data=[{"headline": "U.S. appeals court strikes down FCC net neutrality rules", "lon": "-120.2126139", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0D11420140114", "location": "WASHINGTON ", "lat": "47.2868352", "short_text": "WASHINGTON (Reuters) - A U.S. appeals court on Tuesday rejected federal rules that required Internet providers to treat all web traffic equally, a decision that could allow mobile carriers and other broadband providers to charge content providers for faster access to websites and products."}, {"headline": "Russia's Yandex to get access to Facebook content", "lon": "37.6187012", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0D0IB20140114", "location": "MOSCOW ", "lat": "55.7516147", "short_text": "MOSCOW (Reuters) - Russian internet group Yandex has signed an agreement with Facebook for access to content from some of the social networking site's users in a move to further improve its search results."}, {"headline": "Target apologizes for data breach, retailers embrace security upgrade", "lon": "-78.7375289", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0B01720140113", "location": "BOSTON/NEW YORK ", "lat": "42.6289495", "short_text": "BOSTON/NEW YORK (Reuters) - Target Corp began a major public relations effort on Monday to apologize to customers for an unprecedented cyber attack on its network, but the No. 3 U.S. retailer was vague in providing details about what it knew and when."}, {"headline": "U.S. Supreme Court refuses to hear Internet shopping patent case", "lon": "-120.2126139", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0C13Q20140113", "location": "WASHINGTON ", "lat": "47.2868352", "short_text": "WASHINGTON (Reuters) - The U.S. Supreme Court said on Monday it would not take on an Internet technology patent case that pitted a company accused of aggressively enforcing weak patents against another with an equally tough reputation for fighting patent infringement claims."}, {"headline": "Accenture named lead contractor for Obamacare website: government", "lon": "-120.2126139", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0A0J820140111", "location": "WASHINGTON ", "lat": "47.2868352", "short_text": "WASHINGTON (Reuters) - Accenture has been chosen to replace CGI Federal as the lead contractor for the Obamacare enrollment website, which failed to work when it launched in October for millions of Americans shopping for health insurance, the U.S. Centers for Medicare and Medicaid Services said on Saturday."}, {"headline": "Demand Media moves to separate its domain business", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0C0UT20140113", "location": "", "lat": "None", "short_text": "(Reuters) - Demand Media moved on Monday to spin off its Rightside Group domain business as a separately traded company, according to filing with the U.S. Securities and Exchange Commission."}, {"headline": "Neiman Marcus says hackers may have stolen payment card data", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0A04C20140111", "location": "", "lat": "None", "short_text": "(Reuters) - Luxury department store chain Neiman Marcus said on Friday that hackers may have stolen customers' credit and debit card information, the second cyber attack on a retailer in recent weeks."}, {"headline": "U.S. to part with contractor CGI for Obamacare website", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA090Y520140110", "location": "", "lat": "None", "short_text": "(Reuters) - The U.S. government will part ways next month with contractor CGI Federal over the troubled Obamacare enrollment website, HealthCare.gov, which failed to work when it launched in October for millions of Americans shopping for insurance, the company said on Friday."}, {"headline": "U.S. top court agrees to hear broadcasters' case against Aereo", "lon": "-120.2126139", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0914A20140110", "location": "WASHINGTON ", "lat": "47.2868352", "short_text": "WASHINGTON (Reuters) - The U.S. Supreme Court on Friday agreed to hear a closely watched appeal filed by the four major broadcasters against an online television service, Aereo Inc, backed by media mogul Barry Diller that they claim steals copyright TV content."}, {"headline": "U.S. appeals court strikes down internet rules", "lon": "-120.2126139", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0D0YL20140114", "location": "WASHINGTON ", "lat": "47.2868352", "short_text": "WASHINGTON (Reuters) - A U.S. appeals court on Tuesday struck down the latest effort by the Federal Communications Commission to require internet providers to treat all traffic the same, a policy known as net neutrality."}, {"headline": "US House Democrats request probe into Target card breach", "lon": "-120.2126139", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0C1BT20140113", "location": "WASHINGTON ", "lat": "47.2868352", "short_text": "WASHINGTON (Reuters) - Democratic members of the Financial Services Committee of the U.S. House of Representatives have called on the panel to investigate the hacking of credit and debit card data belonging to millions of customers of retailer Target Corp."}, {"headline": "Exclusive: More well-known U.S. retailers victims of cyber attacks - sources", "lon": "-81.1984426", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0B01720140112", "location": "BOSTON/WASHINGTON ", "lat": "39.8881269", "short_text": "BOSTON/WASHINGTON (Reuters) - Target Corp and Neiman Marcus are not the only U.S. retailers whose networks were breached over the holiday shopping season last year, according to sources familiar with attacks on other merchants that have yet to be publicly disclosed."}, {"headline": "Changing card PIN only first step after Target breach: experts", "lon": "-73.9865812", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0B0L820140112", "location": "NEW YORK ", "lat": "40.7305991", "short_text": "NEW YORK (Reuters) - Changing the security code for your debit card may be as easy 1-2-3 following a widespread data breach at Target but guarding your personal information from hackers is a longer-term battle, according to experts."}, {"headline": "CGI says contract over HealthCare.Gov to end in February", "lon": "-73.9865812", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0915820140110", "location": "NEW YORK ", "lat": "40.7305991", "short_text": "NEW YORK (Reuters) - CGI Group Inc's contract with the U.S. government over the federal HealthCare.Gov website will end next month, the company said on Friday."}, {"headline": "UAE frees American jailed for YouTube parody video", "lon": "55.2961931", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA080QU20140110", "location": "DUBAI ", "lat": "25.2683528", "short_text": "DUBAI (Reuters) - An American citizen was released from jail in the United Arab Emirates on Thursday after serving nine months for posting a parody video on YouTube, his family said."}, {"headline": "India's election regulator drops plan to partner Google", "lon": "77.2159562", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA080YE20140110", "location": "NEW DELHI ", "lat": "28.6138967", "short_text": "NEW DELHI (Reuters) - India's election regulator dropped plans on Thursday to partner Google Inc on a project to ease voter access to information, after a backlash against the move from campaigners who claimed Google and the U.S. government could use the data for spying."}, {"headline": "Google linking of social network contacts to email raises concerns", "lon": "-122.419199", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA081NH20140110", "location": "SAN FRANCISCO ", "lat": "37.7789601", "short_text": "SAN FRANCISCO (Reuters) - A new feature in Google Inc's Gmail will result in some users receiving messages from people with whom they have not shared their email addresses, raising concerns among some privacy advocates."}, {"headline": "Barnes & Noble core retail business stabilized during holidays", "lon": "-73.9865812", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA080OW20140109", "location": "NEW YORK ", "lat": "40.7305991", "short_text": "NEW YORK (Reuters) - Barnes & Noble Inc's mainstay retail business showed signs of stabilizing during the holiday period, renewing the belief on Wall Street that the bookseller's stores remain a viable business."}, {"headline": "India's election regulator drops plan to partner Google after spying fears", "lon": "77.2159562", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA080YE20140109", "location": "NEW DELHI ", "lat": "28.6138967", "short_text": "NEW DELHI (Reuters) - India's election regulator dropped plans on Thursday to partner Google Inc on a project to ease voter access to information, after a backlash against the move from campaigners who fear Google and the U.S. government could use it for spying."}, {"headline": "Millions of French users flock to 4G mobile services", "lon": "2.3521334", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA080VM20140109", "location": "PARIS ", "lat": "48.8565056", "short_text": "PARIS (Reuters) - France's three biggest mobile operators have signed up 1 million customers each to new superfast mobile services, although a hoped for boost in margins from such 4G technology looks unlikely to materialize because of a price war."}]
