data=[{"headline": "Exclusive: More well-known U.S. retailers victims of cyber attacks - sources", "lon": "-81.1984426", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0B01720140113", "location": "BOSTON/WASHINGTON ", "lat": "39.8881269", "short_text": "BOSTON/WASHINGTON (Reuters) - Target Corp and Neiman Marcus are not the only U.S. retailers whose networks were breached over the holiday shopping season last year, according to sources familiar with attacks on other merchants that have yet to be publicly disclosed."}, {"headline": "Accenture named lead contractor for Obamacare website: government", "lon": "-120.2126139", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0A0J820140111", "location": "WASHINGTON ", "lat": "47.2868352", "short_text": "WASHINGTON (Reuters) - Accenture has been chosen to replace CGI Federal as the lead contractor for the Obamacare enrollment website, which failed to work when it launched in October for millions of Americans shopping for health insurance, the U.S. Centers for Medicare and Medicaid Services said on Saturday."}, {"headline": "Neiman Marcus says hackers may have stolen payment card data", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0A04C20140111", "location": "", "lat": "None", "short_text": "(Reuters) - Luxury department store chain Neiman Marcus said on Friday that hackers may have stolen customers' credit and debit card information, the second cyber attack on a retailer in recent weeks."}, {"headline": "U.S. to part with contractor CGI for Obamacare website", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA090Y520140110", "location": "", "lat": "None", "short_text": "(Reuters) - The U.S. government will part ways next month with contractor CGI Federal over the troubled Obamacare enrollment website, HealthCare.gov, which failed to work when it launched in October for millions of Americans shopping for insurance, the company said on Friday."}, {"headline": "U.S. top court agrees to hear broadcasters' case against Aereo", "lon": "-120.2126139", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0914A20140110", "location": "WASHINGTON ", "lat": "47.2868352", "short_text": "WASHINGTON (Reuters) - The U.S. Supreme Court on Friday agreed to hear a closely watched appeal filed by the four major broadcasters against an online television service, Aereo Inc, backed by media mogul Barry Diller that they claim steals copyright TV content."}, {"headline": "Google linking of social network contacts to email raises concerns", "lon": "-122.419199", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA081NH20140110", "location": "SAN FRANCISCO ", "lat": "37.7789601", "short_text": "SAN FRANCISCO (Reuters) - A new feature in Google Inc's Gmail will result in some users receiving messages from people with whom they have not shared their email addresses, raising concerns among some privacy advocates."}, {"headline": "India's election regulator drops plan to partner Google", "lon": "77.2159562", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA080YE20140110", "location": "NEW DELHI ", "lat": "28.6138967", "short_text": "NEW DELHI (Reuters) - India's election regulator dropped plans on Thursday to partner Google Inc on a project to ease voter access to information, after a backlash against the move from campaigners who claimed Google and the U.S. government could use the data for spying."}, {"headline": "Millions of French users flock to 4G mobile services", "lon": "2.3521334", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA080VM20140109", "location": "PARIS ", "lat": "48.8565056", "short_text": "PARIS (Reuters) - France's three biggest mobile operators have signed up 1 million customers each to new superfast mobile services, although a hoped for boost in margins from such 4G technology looks unlikely to materialize because of a price war."}, {"headline": "Barnes & Noble core retail business stabilized during holidays", "lon": "-73.9865812", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA080OW20140109", "location": "NEW YORK ", "lat": "40.7305991", "short_text": "NEW YORK (Reuters) - Barnes & Noble Inc's mainstay retail business showed signs of stabilizing during the holiday period, renewing the belief on Wall Street that the bookseller's stores remain a viable business."}, {"headline": "UAE frees American jailed for YouTube parody video", "lon": "55.2961931", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA080QU20140110", "location": "DUBAI ", "lat": "25.2683528", "short_text": "DUBAI (Reuters) - An American citizen was released from jail in the United Arab Emirates on Thursday after serving nine months for posting a parody video on YouTube, his family said."}, {"headline": "Changing card PIN only first step after Target breach: experts", "lon": "-73.9865812", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0B0L820140112", "location": "NEW YORK ", "lat": "40.7305991", "short_text": "NEW YORK (Reuters) - Changing the security code for your debit card may be as easy 1-2-3 following a widespread data breach at Target but guarding your personal information from hackers is a longer-term battle, according to experts."}, {"headline": "CGI says contract over HealthCare.Gov to end in February", "lon": "-73.9865812", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0915820140110", "location": "NEW YORK ", "lat": "40.7305991", "short_text": "NEW YORK (Reuters) - CGI Group Inc's contract with the U.S. government over the federal HealthCare.Gov website will end next month, the company said on Friday."}, {"headline": "India's election regulator drops plan to partner Google after spying fears", "lon": "77.2159562", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA080YE20140109", "location": "NEW DELHI ", "lat": "28.6138967", "short_text": "NEW DELHI (Reuters) - India's election regulator dropped plans on Thursday to partner Google Inc on a project to ease voter access to information, after a backlash against the move from campaigners who fear Google and the U.S. government could use it for spying."}, {"headline": "Somali al Shabaab rebels ban use of the Internet", "lon": "45.3398349", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA080M920140109", "location": "MOGADISHU ", "lat": "2.0453893", "short_text": "MOGADISHU (Reuters)- Somali rebel group al Shabaab has banned the use of the Internet in the Horn of Africa country, giving telecom operators 15 days to comply with the order, the militants said."}, {"headline": "Video service Hulu adds new shows to original series slate", "lon": "-118.2427025", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA070X820140108", "location": "LOS ANGELES ", "lat": "34.0536781", "short_text": "LOS ANGELES (Reuters) - Video streaming website Hulu is expanding its slate of original programming in 2014 and will introduce four new series including reality TV satire \"The Hotwives of Orlando\" and supernatural comedy \"Deadbeat.\""}, {"headline": "Analysis: Social media empowers anti-mining activists", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA060OA20140107", "location": "TORONTO/BUCHAREST ", "lat": "None", "short_text": "TORONTO/BUCHAREST (Reuters) - Facebook and other social networks are making it easier for anti-mining activists to derail projects, helping them get their message out and organize more quickly against an industry that is already struggling with high costs and volatile prices."}, {"headline": "Lottery companies cash in as China raises bet on punters", "lon": "114.1623665", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA040G920140106", "location": "HONG KONG ", "lat": "22.3858294", "short_text": "HONG KONG (Reuters) - Every day during his lunch break, Chinese businessman Shen Bin buys three lottery tickets for about 33 cents apiece and then watches to see if his chosen numbers flash across television screens suspended from the ceiling."}, {"headline": "Snapchat says millions of user accounts compromised", "lon": "-122.419199", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0201C20140103", "location": "SAN FRANCISCO ", "lat": "37.7789601", "short_text": "SAN FRANCISCO (Reuters) - Snapchat, the red-hot private messaging service, said on Thursday that it knew for months about a security loophole that allowed hackers this week to harvest millions of phone numbers and announced changes to its systems."}, {"headline": "Skype says user information safe in Syrian Electronic Army hack", "lon": "-118.2427025", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0101X20140102", "location": "LOS ANGELES ", "lat": "34.0536781", "short_text": "LOS ANGELES (Reuters) - A day after the Syrian Electronic Army said it had hacked into Skype's social media accounts, the Internet calling service acknowledged on Thursday it had been hit with a \"cyber attack\" but said no user information was compromised."}, {"headline": "Hackers post account info of 4.6 million Snapchat users: report", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0102820140102", "location": "", "lat": "None", "short_text": "(Reuters) - Computer hackers posted online usernames and partial phone numbers of 4.6 million users of mobile photo-sharing service Snapchat, media reports said on Wednesday."}]
