data=[{"headline": "Skype says user information safe in Syrian Electronic Army hack", "lon": "-118.2427025", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0101X20140102", "location": "LOS ANGELES ", "lat": "34.0536781", "short_text": "LOS ANGELES (Reuters) - A day after the Syrian Electronic Army said it had hacked into Skype's social media accounts, the Internet calling service acknowledged on Thursday it had been hit with a \"cyber attack\" but said no user information was compromised."}, {"headline": "Lottery companies cash in as China raises bet on punters", "lon": "114.1623665", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA040G920140105", "location": "HONG KONG ", "lat": "22.3858294", "short_text": "HONG KONG (Reuters) - Every day during his lunch break, Chinese businessman Shen Bin buys three lottery tickets for about 33 cents apiece and then watches to see if his chosen numbers flash across television screens suspended from the ceiling."}, {"headline": "Snapchat says millions of user accounts compromised", "lon": "-122.419199", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0201C20140103", "location": "SAN FRANCISCO ", "lat": "37.7789601", "short_text": "SAN FRANCISCO (Reuters) - Snapchat, the red-hot private messaging service, said on Thursday that it knew for months about a security loophole that allowed hackers this week to harvest millions of phone numbers and announced changes to its systems."}, {"headline": "Exclusive: Hacker took over BBC server, tried to 'sell' access on Christmas Day", "lon": "-71.0595678", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBRE9BS06K20131229", "location": "BOSTON ", "lat": "42.3604823", "short_text": "BOSTON (Reuters) - A hacker secretly took over a computer server at the BBC, Britain's public broadcaster, and then launched a Christmas Day campaign to convince other cyber criminals to pay him for access to the system."}, {"headline": "Analysis: After Web stocks boom, investors wary but rout unlikely", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBRE9BS06920131229", "location": "SAN FRANCISCO/NEW YORK ", "lat": "None", "short_text": "SAN FRANCISCO/NEW YORK (Reuters) - For investors in internet stocks, it was a banner year: shares of many companies doubled as revenue climbed and on forecasts for rip-roaring growth in earnings. But the gains haven't been anxiety-free, thanks to uncomfortable memories of the 1999 Internet bubble and subsequent bust."}, {"headline": "Target says PINs stolen, but confident data secure", "lon": "-78.7375289", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBRE9BQ0EK20131227", "location": "BOSTON/NEW YORK ", "lat": "42.6289495", "short_text": "BOSTON/NEW YORK (Reuters) - Target Corp said PIN data of some customers' bank ATM cards were stolen in a massive cyber attack at the third-largest U.S. retailer, but it was confident that the information was \"safe and secure.\""}, {"headline": "Reddit reaches for profits through a geek-culture bazaar", "lon": "-122.419199", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBRE9BR04F20131228", "location": "SAN FRANCISCO ", "lat": "37.7789601", "short_text": "SAN FRANCISCO (Reuters) - Social news hub Reddit snagged an interview with Barack Obama last year. The big get for 2013 was reaching 90 million unique visitors a month, according to the company, on par with the likes of eBay. This season, even Microsoft co-founder and philanthropist Bill Gates joined its Secret Santa gift exchange."}, {"headline": "Italy delays 'Google tax' until July, OKs funds for business, welfare", "lon": "12.4830619", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBRE9BQ0JH20131227", "location": "ROME ", "lat": "41.8932575", "short_text": "ROME (Reuters) - Italy delayed the start of its planned Internet tax until July 2014, approved billions of euros in business and welfare measures and extended a ban on media cross-ownership in a final package of year-end legislation approved on Friday."}, {"headline": "Delta website glitch offers up tickets at rock-bottom rates", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBRE9BP0II20131226", "location": "", "lat": "None", "short_text": "(Reuters) - A website glitch on Thursday morning caused some Delta Airlines fares to be offered at deep discounts to normal prices, including a reported roundtrip between New York and Los Angeles for $40."}, {"headline": "Russia targets cross-border online shoppers with new duty rules", "lon": "37.3273304", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBRE9BN08X20131224", "location": "MOSCOW ", "lat": "55.4792046", "short_text": "MOSCOW (Reuters) - Russia plans to start charging duty on purchases worth more than 150 euros ($210) from foreign online stores, lowering the threshold from 1,000 euros and potentially slowing the fast-growing market while benefiting domestic online retailers."}, {"headline": "Hackers post account info of 4.6 million Snapchat users: report", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0102820140102", "location": "", "lat": "None", "short_text": "(Reuters) - Computer hackers posted online usernames and partial phone numbers of 4.6 million users of mobile photo-sharing service Snapchat, media reports said on Wednesday."}, {"headline": "Japan's 7-Eleven kingpin looks to U.S. to inspire online revolution", "lon": "139.7685224", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBRE9BN03U20131224", "location": "TOKYO ", "lat": "35.6800712", "short_text": "TOKYO (Reuters) - The 81-year-old Japanese executive who built 7-Eleven into the world's biggest convenience store chain has a new mission: turning more than 50,000 bricks and mortar stores in Japan into portals to a new online retail empire."}, {"headline": "Hulu must face privacy lawsuit, U.S. judge rules", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBRE9BM0OJ20131223", "location": "", "lat": "None", "short_text": "(Reuters) - Hulu has failed to persuade a federal judge to dismiss a lawsuit accusing the video streaming service of illegally sharing users' viewing history with Facebook Inc and business metrics company comScore Inc."}, {"headline": "Austrian court denies telecom firms a delay on 4G license payments", "lon": "16.3730908", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBRE9BM0D420131223", "location": "VIENNA ", "lat": "48.2084671", "short_text": "VIENNA (Reuters) - Austria's Constitutional Court has declined to issue an injunction that would let mobile telecoms operators delay paying 2 billion euros ($2.73 billion) for 4G radio frequencies they won at auction, T-Mobile Austria said on Monday."}, {"headline": "Not in New York? App lets revelers ring in New Year's Eve remotely", "lon": "-79.3849008", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBRE9BM09J20131223", "location": "TORONTO ", "lat": "43.6529206", "short_text": "TORONTO (Reuters) - Revelers who can't make it to New York's Times Square to celebrate New Year's Eve can download an app to make sure they see the ball drop."}, {"headline": "Online retailer N Brown to increase UK presence: paper", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBRE9BL0EU20131222", "location": "", "lat": "None", "short_text": "(Reuters) - Internet and catalogue retailer N Brown Group plc, which owns the Jacamo and Simply Be brands, is seeking to expand its presence in the UK, The Daily Telegraph reported."}, {"headline": "Fired PR executive apologizes for AIDS in Africa tweet", "lon": "-73.9865812", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBRE9BL0CW20131222", "location": "NEW YORK ", "lat": "40.7305991", "short_text": "NEW YORK (Reuters) - A public relations executive who ignited an online furor after posting a message on Twitter joking about AIDS in Africa, apologized on Sunday, saying she was ashamed of her comment."}, {"headline": "NYC PR executive loses job after Twitter post about AIDS in Africa", "lon": "-73.9865812", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBRE9BK0DN20131221", "location": "NEW YORK ", "lat": "40.7305991", "short_text": "NEW YORK (Reuters) - A public relations executive for the prominent New York-based Internet media company IAC lost her job on Saturday after she posted a message joking about AIDS in Africa and race on her Twitter account, sparking an online furor."}, {"headline": "News Corp acquires social media tool Storyful", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBRE9BJ1AL20131220", "location": "", "lat": "None", "short_text": "(Reuters) - News Corp on Friday made its first acquisition as a stand-alone company with the $25 million purchase of social news tool Storyful."}, {"headline": "Gloves off as mobile game developers wage Christmas war", "lon": "-122.419199", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBRE9BJ0P620131220", "location": "SAN FRANCISCO ", "lat": "37.7789601", "short_text": "SAN FRANCISCO (Reuters) - The annual no-holds-barred Christmas holiday slugfest between mobile game developers has a new twist this year: marketing and user-acquisition costs will likely hit an all-time high and surpass any revenue earned over the festive season."}]
