data=[{"headline": "Google's strength in advertising to drive growth: analysts", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0T1UO20140131", "location": "", "lat": "None", "short_text": "(Reuters) - Google Inc looks set to extend its leadership in online advertising as it sharpens its focus on its core business, analysts said after strong ad sales helped the No. 1 search company report stronger-than-expected quarterly revenue."}, {"headline": "Icelandic social media site targets surveillance-weary users", "lon": "10.7391112", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA1208V20140203", "location": "OSLO ", "lat": "59.9132694", "short_text": "OSLO (Reuters) - Upstart social media platform Vivaldi aims to capture tech savvy users seeking to avoid aggressive advertising and the prying eyes of governments, and hopes for a boost from the closure of a rival, founder Jon von Tetzchner told Reuters."}, {"headline": "Facebook looks to nab Twitter's 'second screen' crown in Super Bowl", "lon": "-122.419199", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0U0C720140131", "location": "SAN FRANCISCO ", "lat": "37.7789601", "short_text": "SAN FRANCISCO (Reuters) - More than 100 million people will be glued to their TV screens on Sunday, when the Denver Broncos take on the Seattle Seahawks in America's premier sporting contest, the Super Bowl."}, {"headline": "Coupons.com files for IPO of up to $100 million", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0U1VQ20140131", "location": "", "lat": "None", "short_text": "(Reuters) - Online coupon company Coupons.com Inc filed with U.S. regulators to raise up to $100 million in an initial public offering of its common stock."}, {"headline": "Exclusive: Wayfair raises around $150 million in funding", "lon": "-122.419199", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0U1N120140131", "location": "SAN FRANCISCO ", "lat": "37.7789601", "short_text": "SAN FRANCISCO (Reuters) - Wayfair, the online home-furnishings site, is raising around $150 million at a valuation of around $2 billion, according to a person familiar with the matter, underscoring the appeal of select online retailers."}, {"headline": "Yahoo says detected hacking attempt on email accounts", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0T21H20140131", "location": "", "lat": "None", "short_text": "(Reuters) - Yahoo Inc said it had detected a \"coordinated effort\" to gain unauthorized access to Yahoo Mail accounts using malicious computer software."}, {"headline": "SEC examiners to review how asset managers fend off cyber attacks", "lon": "-120.2126139", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0T1PJ20140130", "location": "WASHINGTON ", "lat": "47.2868352", "short_text": "WASHINGTON (Reuters) - U.S. regulators said Thursday they plan to scrutinize whether asset managers have policies to prevent and detect cyber attacks and are properly safeguarding against security risks that could arise from vendors having access to their systems."}, {"headline": "One Kings Lane raises $112 million; online company's value nears $1 billion", "lon": "-122.419199", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0T1W620140130", "location": "SAN FRANCISCO ", "lat": "37.7789601", "short_text": "SAN FRANCISCO (Reuters) - One Kings Lane, the online home-furnishings company, has raised $112 million, catapulting it into an elite group of venture-backed companies valued in the billion-dollar range."}, {"headline": "Alibaba rival JD.com files for U.S. listing", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0T0RV20140130", "location": "", "lat": "None", "short_text": "(Reuters) - JD.com, China's second-largest e-commerce company, filed for a U.S. listing of its shares, following market leader Alibaba Group Holding Ltd in tapping into rising investor enthusiasm surrounding China's booming online retail market."}, {"headline": "Joyce on your iPad - bringing 'The Dead' to life", "lon": "-6.2600969", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0T0O720140130", "location": "DUBLIN ", "lat": "53.3494299", "short_text": "DUBLIN (Reuters) - \"Snow was general all over Ireland,\" the noted Irish stage actor Barry McGovern intones while reading the famous line from James Joyce's \"The Dead\" in a free app for iPads that seeks to bring the heart-rending story to life for the high-tech age."}, {"headline": "Google's outsized ad growth offsets steep price decline", "lon": "-122.419199", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0T1UO20140130", "location": "SAN FRANCISCO ", "lat": "37.7789601", "short_text": "SAN FRANCISCO (Reuters) - Google Inc's quarterly revenue beat Wall Street's target despite an ongoing decline in prices for its online ads and deepening losses at Motorola, the handset-making division to be sold to China's Lenovo."}, {"headline": "Mobile ad revenue lifts Facebook past Wall Street targets", "lon": "-122.419199", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0S1ZO20140130", "location": "SAN FRANCISCO ", "lat": "37.7789601", "short_text": "SAN FRANCISCO (Reuters) - Facebook Inc delivered its strongest revenue growth in two years, beating Wall Street targets as the Internet company's mobile ad sales continued to accelerate."}, {"headline": "Wyoming among states eyeing laws to ban Google Glass while driving", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0S25A20140129", "location": "", "lat": "None", "short_text": "(Reuters) - Sparsely populated Wyoming, whose natural beauty draws tourists from around the globe, is among a small number of U.S. states eyeing a ban on the use of wearable computers while driving, a move that appears to target Google Glass."}, {"headline": "Baidu scrambles to monetize its mobile real estate", "lon": "116.625088590652", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0S1YQ20140129", "location": "BEIJING ", "lat": "40.2505379", "short_text": "BEIJING (Reuters) - China's Baidu Inc knows where you are, where you're going and when you want dumplings, guiding you from web page to restaurant when you use its search engine."}, {"headline": "Facebook cites progress on low-power server technology", "lon": "-121.8831349", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0R1OZ20140128", "location": "SAN JOSE, California ", "lat": "37.3438502", "short_text": "SAN JOSE, California (Reuters) - Facebook Inc's executive in charge of revolutionizing data centers on Tuesday lauded low-energy server technology that is expected to compete against heavyweight Intel Corp."}, {"headline": "EU justice chief attacks European \"hypocrisy\" on spying", "lon": "4.36748762309029", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0R1JH20140128", "location": "BRUSSELS ", "lat": "50.84340935", "short_text": "BRUSSELS (Reuters) - Some EU countries that have criticized U.S. cyber surveillance are \"hypocritical\" as they themselves are failing to protect citizens' private information, the European Union's top justice official said on Tuesday."}, {"headline": "World Bank invests in online retail in developing economies", "lon": "13.3888599", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0R0FU20140128", "location": "BERLIN ", "lat": "52.5170365", "short_text": "BERLIN (Reuters) - The World Bank's private-sector arm is investing up to 25 million euros ($34.18 million) in two online retailers, Lamoda in Russia and Dafiti in Latin America, the latest fundraising success for German venture capital firm Rocket Internet."}, {"headline": "U.S. frees tech companies to give more spying data", "lon": "-120.2126139", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0Q1OF20140127", "location": "WASHINGTON ", "lat": "47.2868352", "short_text": "WASHINGTON (Reuters) - U.S. technology companies may give the public and their customers more detail about the court orders they receive related to surveillance under an agreement they reached on Monday with the Obama administration."}, {"headline": "U.S., British spy agencies exploit 'leaky' apps for intel: report", "lon": "-120.2126139", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0Q1NC20140127", "location": "WASHINGTON ", "lat": "47.2868352", "short_text": "WASHINGTON (Reuters) - U.S. and British intelligence agencies have plotted ways to gather data from Angry Birds and other smartphone apps that leak users' personal information onto global networks, the New York Times reported on Monday."}, {"headline": "Comcast adds live streaming to TV for Olympics digital coverage", "lon": "-118.2427025", "weblink": "http://us.mobile.reuters.com/shortArticle/internetNews/idUSBREA0Q1IY20140127", "location": "LOS ANGELES ", "lat": "34.0536781", "short_text": "LOS ANGELES (Reuters) - Comcast Corp will launch its most ambitious digital video and on-demand effort yet for the Winter Olympics, using the games' vast audience to promote and test its newest viewing features for televisions, tablets and mobile phones."}]
