data=[{"headline": "Orbital Sciences cargo ship arrives at space station", "lon": "-80.6033001171566", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBREA0B09K20140112", "location": "CAPE CANAVERAL, Florida ", "lat": "28.38823385", "short_text": "CAPE CANAVERAL, Florida (Reuters) - Orbital Sciences Corp, one of two companies hired by U.S. space agency NASA to make supply runs to the International Space Station, delivered its first cargo ship on Sunday, a NASA TV broadcast showed."}, {"headline": "Virgin Galactic spaceship makes third powered test flight", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBREA0911M20140110", "location": "", "lat": "None", "short_text": "(Reuters) - Virgin Galactic's SpaceShipTwo, a six-passenger, two-pilot spacecraft aiming to make the world's first commercial suborbital spaceflights later this year, conducted its third rocket-powered test flight on Friday."}, {"headline": "Space-faring nations lay groundwork for human, robotic exploration", "lon": "-120.2126139", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBREA0A01Z20140111", "location": "WASHINGTON ", "lat": "47.2868352", "short_text": "WASHINGTON (Reuters) - Officials from 32 of the world's space-faring nations concluded a trio of summits on Friday to tackle expanding participation in the International Space Station and planning for eventual human expeditions to Mars."}, {"headline": "U.S., Canada sign agreement to share data on space debris", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBREA0A01T20140111", "location": "", "lat": "None", "short_text": "(Reuters) - The United States and Canada have signed an agreement to share data on orbiting space debris, asteroids and other hazards to space flight, the U.S. military said on Friday."}, {"headline": "Orbital Sciences' cargo ship blasts off for space station", "lon": "-120.2126139", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBREA0816820140109", "location": "WASHINGTON ", "lat": "47.2868352", "short_text": "WASHINGTON (Reuters) - An unmanned Orbital Sciences Corp. Antares rocket blasted off on Thursday to deliver the first of eight cargo ships to the International Space Station for NASA."}, {"headline": "Obama agrees to 4-year extension for International Space Station", "lon": "-120.2126139", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBREA071EX20140108", "location": "WASHINGTON ", "lat": "47.2868352", "short_text": "WASHINGTON (Reuters) - The Obama administration wants to keep the International Space Station, a $100 billion orbital research outpost that is a project of 15 nations, flying until at least 2024, four years beyond a previous target, NASA said on Wednesday."}, {"headline": "SpaceX Falcon rocket lifts off with Thaicom digital TV satellite", "lon": "-80.6033001171566", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBREA0514L20140107", "location": "CAPE CANAVERAL, Florida ", "lat": "28.38823385", "short_text": "CAPE CANAVERAL, Florida (Reuters) - A Space Exploration Technologies' Falcon 9 rocket blasted off from Cape Canaveral Air Force Station in Florida on Monday to put a commercial communications spacecraft into orbit for Thai satellite operator Thaicom."}, {"headline": "Over a thousand candidates shortlisted for life on Mars", "lon": "4.9001115", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBREA010N620140102", "location": "AMSTERDAM ", "lat": "52.3710088", "short_text": "AMSTERDAM (Reuters) - A mission to put humans on Mars that drew 200,000 applicants has selected more than a thousand candidates who will now be tested to come up with a final list of 24 would-be Mars-dwellers."}, {"headline": "Relapse of 'cured' HIV patients spurs AIDS science on", "lon": "-0.1276597", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBREA010B520140102", "location": "LONDON ", "lat": "51.5072759", "short_text": "LONDON (Reuters) - Scientists seeking a cure for AIDS say they have been inspired, not crushed, by a major setback in which two HIV positive patients believed to have been cured found the virus re-invading their bodies once more."}, {"headline": "Technical problem delays space station streaming-video venture", "lon": "-80.6033001171566", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBRE9BQ0FN20131228", "location": "CAPE CANAVERAL, Florida ", "lat": "28.38823385", "short_text": "CAPE CANAVERAL, Florida (Reuters) - Spacewalking cosmonauts on Friday installed two cameras outside the International Space Station for a Canadian streaming-video business but then retrieved the gear after electrical connections failed, officials said."}, {"headline": "Russia launches new Soyuz rocket", "lon": "37.6187012", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBRE9BP02S20131228", "location": "MOSCOW ", "lat": "55.7516147", "short_text": "MOSCOW (Reuters) - Russia successfully launched an upgraded version of its Soviet-design Soyuz rocket on Saturday, the Defence Ministry said, giving a boost to the country's troubled space program."}, {"headline": "Camera glitch triggers marathon Russian spacewalk", "lon": "-80.6033001171566", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBRE9BE0FR20131227", "location": "CAPE CANAVERAL, Florida ", "lat": "28.38823385", "short_text": "CAPE CANAVERAL, Florida (Reuters) - Spacewalking Russian cosmonauts on Friday spent over eight hours installing two cameras outside the International Space Station for a Canadian streaming-video business and then retrieving the gear due to connectivity problems."}, {"headline": "China says satellite network to be big asset, others can use it too", "lon": "116.625088590652", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBRE9BQ01B20131227", "location": "BEIJING ", "lat": "40.2505379", "short_text": "BEIJING (Reuters) - China's homegrown satellite navigation system will bring untold economic, social and military benefits and other countries in Asia are welcome to use it, the director of China's satellite navigation agency said on Friday."}, {"headline": "Russia bets on sweeping reform to revive ailing space industry", "lon": "63.3069738", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBRE9BP02S20131226", "location": "BAIKONUR, Kazakhstan ", "lat": "45.630083", "short_text": "BAIKONUR, Kazakhstan (Reuters) - From rocket-shaped playground equipment to faded murals of cosmonauts, mementos of the heyday of Soviet space exploration are scattered around this sandswept town that launched Yuri Gagarin into orbit in 1961."}, {"headline": "Making waves: In the hunt for invisibility, other benefits seen", "lon": "103.8528878", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBRE9BO0AY20131225", "location": "SINGAPORE ", "lat": "1.2909305", "short_text": "SINGAPORE (Reuters) - A new way of assembling things, called metamaterials, may in the not too distant future help to protect a building from earthquakes by bending seismic waves around it. Similarly, tsunami waves could be bent around towns, and soundwaves bent around a room to make it soundproof."}, {"headline": "Spacewalkers install new station cooling pump", "lon": "-80.6033001171566", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBRE9BE0FR20131224", "location": "CAPE CANAVERAL, Florida ", "lat": "28.38823385", "short_text": "CAPE CANAVERAL, Florida (Reuters) - Two NASA astronauts spent more than seven hours working outside the International Space Station on Tuesday and successfully repaired a critical cooling system."}, {"headline": "Astronauts ready for second spacewalk to repair station", "lon": "-80.6033001171566", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBRE9BE0FR20131223", "location": "CAPE CANAVERAL, Florida ", "lat": "28.38823385", "short_text": "CAPE CANAVERAL, Florida (Reuters) - Astronauts aboard the International Space Station are planning a second and final spacewalk to fix the outpost's cooling system early on Tuesday, a NASA official said."}, {"headline": "Robots to the rescue at international trials in Florida", "lon": "-80.4775569", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBRE9BK0D420131222", "location": "HOMESTEAD ", "lat": "25.4687224", "short_text": "HOMESTEAD (Reuters) - As a squat, red-and-black robot nicknamed CHIMP gingerly pushed open a spring-loaded door a gust of wind swooped down onto the track at the Homestead-Miami Speedway and slammed the door shut, eliciting a collective sigh of disappointment from the audience."}, {"headline": "Astronauts nail first spacewalk to fix station's cooling system", "lon": "-80.6033001171566", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBRE9BE0FR20131221", "location": "CAPE CANAVERAL, Florida ", "lat": "28.38823385", "short_text": "CAPE CANAVERAL, Florida (Reuters) - Two NASA astronauts, their spacesuits rigged with snorkels in case of a water leak, floated outside the International Space Station for 5-1/2 hours on Saturday, successfully completing the first steps to fix the outpost's cooling system."}, {"headline": "China to expand presence in Antarctica with new research bases", "lon": "116.625088590652", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBRE9BI0BW20131219", "location": "BEIJING ", "lat": "40.2505379", "short_text": "BEIJING (Reuters) - China will expand its presence in Antarctica by building a fourth research base and finding a site for a fifth, a state-run newspaper said on Thursday, as the country steps up its increasingly far-flung scientific efforts."}]
