data=[{"headline": "Scientists hail breakthrough in embryonic-like stem cells", "lon": "-0.1276597", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBREA0S0UM20140130", "location": "LONDON ", "lat": "51.5072759", "short_text": "LONDON (Reuters) - In experiments that could open a new era in stem cell biology, scientists have found a simple way to reprogram mature animal cells back into an embryonic-like state that allows them to generate many types of tissue."}, {"headline": "Ophidiophobics beware: flying snakes have great aerodynamics", "lon": "-120.2126139", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBREA0T1SK20140130", "location": "WASHINGTON ", "lat": "47.2868352", "short_text": "WASHINGTON (Reuters) - This may be the last thing that anyone with a touch of ophidiophobia - fear of snakes - would want to hear: flying snakes have surprisingly good aerodynamic qualities."}, {"headline": "New big-headed fish species discovered in Idaho and Montana rivers", "lon": "-113.8959008", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBREA0T1QW20140130", "location": "SALMON, Idaho ", "lat": "45.1757547", "short_text": "SALMON, Idaho (Reuters) - A tiny fish characterized by a disproportionately large head and previously unknown to scientists has been found in mountain rivers of Idaho and Montana in what biologists said on Thursday marked a rare discovery."}, {"headline": "Modern humans more Neanderthal than once thought, studies suggest", "lon": "-73.9865812", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBREA0S1RX20140129", "location": "NEW YORK ", "lat": "40.7305991", "short_text": "NEW YORK (Reuters) - It's getting harder and harder to take umbrage if someone calls you a Neanderthal."}, {"headline": "Now for the weather on Luhman: Cloudy with a chance of molten iron rain", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBREA0S27C20140129", "location": "", "lat": "None", "short_text": "(Reuters) - You think the weather is bad on Earth lately. On Luhman 16B, a hybrid planet-star located 6.7 light years away, scientists say it's raining molten iron, research released on Wednesday shows."}, {"headline": "California weighs giving tax break to space exploration firms", "lon": "-121.2980707", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBREA0T00Y20140130", "location": "SACRAMENTO, California ", "lat": "38.4732259", "short_text": "SACRAMENTO, California (Reuters) - For-profit space explorers who make California their headquarters would not have to pay property taxes on their rockets and space stations under a bill that advanced in the state legislature on Wednesday."}, {"headline": "Long lunar night wait for China's malfunctioning Jade Rabbit moon rover", "lon": "116.625088590652", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBREA0S0AF20140129", "location": "BEIJING ", "lat": "40.2505379", "short_text": "BEIJING (Reuters) - Chinese scientists will have to wait until the end of a long lunar night, lasting about 14 earth days, to see if repair efforts on the country's first moon rover, dubbed Jade Rabbit, were successful, state media said."}, {"headline": "NASA puts out call for commercial lunar landers", "lon": "-80.6033001171566", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBREA0Q1OA20140127", "location": "CAPE CANAVERAL, Florida ", "lat": "28.38823385", "short_text": "CAPE CANAVERAL, Florida (Reuters) - Under a new program called Lunar Catalyst, U.S. space agency NASA will provide free technical expertise, equipment, facilities and software to help selected companies develop lunar landers, officials said on Monday."}, {"headline": "Cosmonauts make repeat spacewalk for Canadian video venture", "lon": "-80.6033001171566", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBREA0Q1SR20140127", "location": "CAPE CANAVERAL, Florida ", "lat": "28.38823385", "short_text": "CAPE CANAVERAL, Florida (Reuters) - A pair of Russian cosmonauts floated outside the International Space Station on Monday in a second attempt to set up cameras for a Canadian space video venture."}, {"headline": "Rocket blasts off with NASA communications satellite", "lon": "-80.6033001171566", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBREA0N07T20140124", "location": "CAPE CANAVERAL, Florida ", "lat": "28.38823385", "short_text": "CAPE CANAVERAL, Florida (Reuters) - An unmanned rocket blasted off from Cape Canaveral Air Force Station on Thursday to put the newest member of NASA's space communications network into orbit."}, {"headline": "British scientists seek go-ahead for GM 'Omega-3' crop trial", "lon": "-0.1276597", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBREA0N0M720140124", "location": "LONDON ", "lat": "51.5072759", "short_text": "LONDON (Reuters) - British scientists have applied for permission to run an open-air field trial of a genetically modified (GM) crop they hope may one day become a sustainable and environmentally friendly source of healthy Omega-3 fats."}, {"headline": "NASA rover Opportunity finds signs Mars once had fresh water", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBREA0M24P20140123", "location": "", "lat": "None", "short_text": "(Reuters) - NASA's decade-old Mars rover, Opportunity, has found evidence that life-friendly fresh water once pooled on the red planet's surface, reinforcing similar discoveries made by newcomer Curiosity on the other side of the planet, scientists said on Thursday."}, {"headline": "Water vapor plumes raise question about life on dwarf planet Ceres", "lon": "-120.2126139", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBREA0M02J20140123", "location": "WASHINGTON ", "lat": "47.2868352", "short_text": "WASHINGTON (Reuters) - The dwarf planet Ceres, one of the most intriguing objects in the solar system, is gushing water vapor from its unusual ice-covered surface, scientists said on Wednesday in a finding that raises the question of whether it might be hospitable to life."}, {"headline": "Flies with brothers make gentler lovers", "lon": "-0.1276597", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBREA0L1RU20140122", "location": "LONDON ", "lat": "51.5072759", "short_text": "LONDON (Reuters) - Flies who play the mating game while also living with their brothers are gentler to females during sex and tend to hassle them less, according a study by British scientists."}, {"headline": "Mystery white rock inexplicably appears near NASA Mars rover", "lon": "-80.6033001171566", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBREA0L00420140122", "location": "CAPE CANAVERAL, Florida ", "lat": "28.38823385", "short_text": "CAPE CANAVERAL, Florida (Reuters) - Scientists are stumped as to how a rock mysteriously appeared in images taken two weeks apart by NASA's Mars rover Opportunity."}, {"headline": "Analysis - Syngenta risks fresh China corn dispute with unapproved trait", "lon": "-87.6243706", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBREA0K0T620140121", "location": "CHICAGO ", "lat": "41.8756208", "short_text": "CHICAGO (Reuters) - Syngenta AG is pressing ahead with U.S. sales of a new corn trait that is not approved in China, fueling concerns of another jarring GMO trade quarrel with the world's fastest-growing food importer."}, {"headline": "Syngenta risks fresh China corn dispute with unapproved trait", "lon": "-87.6243706", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBREA0K0SV20140121", "location": "CHICAGO ", "lat": "41.8756208", "short_text": "CHICAGO (Reuters) - Syngenta AG is pressing ahead with U.S. sales of a new corn trait that is not approved in China, fueling concerns of another jarring GMO trade quarrel with the world's fastest-growing food importer."}, {"headline": "Spacecraft Rosetta roused from slumber on comet-chasing quest", "lon": "8.66195118582712", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBREA0J1A720140120", "location": "FRANKFURT ", "lat": "50.12134215", "short_text": "FRANKFURT (Reuters) - Comet-chasing spacecraft Rosetta woke from nearly three years of hibernation on Monday to complete a decade-long deep space mission that scientists hope will help unlock some of the secrets of the solar system."}, {"headline": "Robotic probe to awaken for comet rendezvous, landing", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBREA0I0IF20140120", "location": "", "lat": "None", "short_text": "(Reuters) - After a 10-year journey, Europe's Rosetta spacecraft is due to end its hibernation on Monday and prepare for an unprecedented mission to orbit a comet and dispatch a lander to the surface."}, {"headline": "China confirms hypersonic missile carrier test", "lon": "116.625088590652", "weblink": "http://us.mobile.reuters.com/shortArticle/scienceNews/idUSBREA0F03R20140116", "location": "BEIJING ", "lat": "40.2505379", "short_text": "BEIJING (Reuters) - China has flight-tested a hypersonic missile delivery vehicle in a move that was scientific in nature and not targeted at any country, the Defence Ministry said on Wednesday."}]
