data=[{"headline": "With data vulnerable, retailers look for tougher security", "lon": "-78.7375289", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0C09O20140113", "location": "BOSTON/NEW YORK ", "lat": "42.6289495", "short_text": "BOSTON/NEW YORK (Reuters) - A top retail trade group executive on Sunday called for tougher security standards that could mean more spending for the industry, its banks and business partners after a series of data breaches at major merchants."}, {"headline": "Want to quit your job? New app does it for you via text message", "lon": "-79.3849008", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0C0II20140113", "location": "TORONTO ", "lat": "43.6529206", "short_text": "TORONTO (Reuters) - Thinking about quitting your job? A humorous new app aims to relieve the stress and anxiety of confronting the boss with the news by sending a text message instead."}, {"headline": "New Acer CEO disappoints with lack of detail on future plans", "lon": "121.5637", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0C0HF20140113", "location": "TAIPEI ", "lat": "25.0375167", "short_text": "TAIPEI (Reuters) - Investors looking for specifics as to the future of Acer Inc, the world's No.4 PC vendor, came away disappointed when the new CEO spent more time delivering a history of the company's past mistakes than on where it was headed."}, {"headline": "Target planning 'significant changes' after data breach - CNBC", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA090L120140113", "location": "", "lat": "None", "short_text": "(Reuters) - Target Corp plans to make \"significant changes\" in light of the data breach during the holiday shopping season when hackers stole personal information of millions of customers, the U.S. retailer's chief executive said in an interview with CNBC aired on Monday."}, {"headline": "Accenture named lead contractor for Obamacare website: government", "lon": "-120.2126139", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0A0J820140111", "location": "WASHINGTON ", "lat": "47.2868352", "short_text": "WASHINGTON (Reuters) - Accenture has been chosen to replace CGI Federal as the lead contractor for the Obamacare enrollment website, which failed to work when it launched in October for millions of Americans shopping for health insurance, the U.S. Centers for Medicare and Medicaid Services said on Saturday."}, {"headline": "Price war in U.S. mobile market raises fear of profit hemorrhage", "lon": "-73.9865812", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0A08U20140111", "location": "NEW YORK ", "lat": "40.7305991", "short_text": "NEW YORK (Reuters) - New Year's rivalry among U.S. mobile operators has Wall Street worried that the industry's profits could seriously decline."}, {"headline": "Australia's Telstra to offload majority stake in struggling Sensis", "lon": "151.2164539", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0A05L20140113", "location": "SYDNEY ", "lat": "-33.8548157", "short_text": "SYDNEY (Reuters) - Australia's biggest phone company Telstra Corporation Ltd has agreed to sell 70 percent of its directories unit Sensis, offloading a struggling business challenged by digital transition for less than the market had anticipated."}, {"headline": "Neiman Marcus says hackers may have stolen payment card data", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0A04C20140111", "location": "", "lat": "None", "short_text": "(Reuters) - Luxury department store chain Neiman Marcus said on Friday that hackers may have stolen customers' credit and debit card information, the second cyber attack on a retailer in recent weeks."}, {"headline": "China's ambitious handset makers face tough sell in U.S.", "lon": "-115.1611806", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA091BT20140110", "location": "LAS VEGAS ", "lat": "36.145204", "short_text": "LAS VEGAS (Reuters) - LG Electronics executive Frank Lee bounded onto a Las Vegas stage this week to show off a new phone for the U.S. market, the 6-inch G-Flex, which boasts a curved screen."}, {"headline": "U.S. to part with contractor CGI for Obamacare website", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA090Y520140110", "location": "", "lat": "None", "short_text": "(Reuters) - The U.S. government will part ways next month with contractor CGI Federal over the troubled Obamacare enrollment website, HealthCare.gov, which failed to work when it launched in October for millions of Americans shopping for insurance, the company said on Friday."}, {"headline": "Exclusive: More well-known U.S. retailers victims of cyber attacks - sources", "lon": "-81.1984426", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0B01720140113", "location": "BOSTON/WASHINGTON ", "lat": "39.8881269", "short_text": "BOSTON/WASHINGTON (Reuters) - Target Corp and Neiman Marcus are not the only U.S. retailers whose networks were breached over the holiday shopping season last year, according to sources familiar with attacks on other merchants that have yet to be publicly disclosed."}, {"headline": "Changing card PIN only first step after Target breach: experts", "lon": "-73.9865812", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0B0L820140112", "location": "NEW YORK ", "lat": "40.7305991", "short_text": "NEW YORK (Reuters) - Changing the security code for your debit card may be as easy 1-2-3 following a widespread data breach at Target but guarding your personal information from hackers is a longer-term battle, according to experts."}, {"headline": "Australia's Telstra may sell Sensis for $2.7 billion: report", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0A05L20140111", "location": "", "lat": "None", "short_text": "(Reuters) - - Australia's biggest phone company Telstra Corp. is in advanced talks with a U.S. private equity firm over the sale of its Sensis directories business for as much as A$3 billion ($2.7 bln), local media reported on Saturday."}, {"headline": "Target breach worse than thought; states launch joint probe", "lon": "-75.817822", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA090L120140111", "location": "NEW YORK/BOSTON ", "lat": "43.093787", "short_text": "NEW YORK/BOSTON (Reuters) - The data breach at Target Corp over the holiday shopping season was far bigger than initially thought, the U.S. company said on Friday, as state prosecutors announced a nationwide probe into the second-biggest retail cyber attack on record."}, {"headline": "Factbox: How to deal with Target's data breach", "lon": "-73.9865812", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0915320140111", "location": "NEW YORK ", "lat": "40.7305991", "short_text": "NEW YORK (Reuters) - The number of people affected by Target's data breach during the holiday season is now expected to be least 70 million, up from the company's original estimate of 40 million. That means many more people need to assess their credit and debit card security."}, {"headline": "Tesla upgrades car charging software, adapter to prevent fires", "lon": "-122.419199", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA091CC20140110", "location": "SAN FRANCISCO ", "lat": "37.7789601", "short_text": "SAN FRANCISCO (Reuters) - Tesla Motors Inc is taking steps to prevent overheating of its charging systems, including giving customers upgraded wall adapters and providing charging-software upgrades, the electric-car company said Friday."}, {"headline": "Target breach worse than thought, states launch joint probe", "lon": "-75.817822", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA090L120140110", "location": "NEW YORK/BOSTON ", "lat": "43.093787", "short_text": "NEW YORK/BOSTON (Reuters) - The data breach at Target Corp over the holiday shopping season was far bigger than initially thought, the U.S. company said on Friday, as state prosecutors announced a nationwide probe into the second-biggest retail cyber attack on record."}, {"headline": "Top U.S. court to hear Limelight patent case", "lon": "-120.2126139", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA091A820140110", "location": "WASHINGTON ", "lat": "47.2868352", "short_text": "WASHINGTON (Reuters) - The U.S. Supreme Court on Friday agreed to hear a patent case involving technology for managing web images and video that features Limelight Networks Ltd and Akamai Technologies and which has been closely followed by much of the high-tech world for years."}, {"headline": "U.S. states working together to probe Target: NY attorney general", "lon": "-71.0595678", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA090VK20140110", "location": "BOSTON ", "lat": "42.3604823", "short_text": "BOSTON (Reuters) - State attorneys general from around the country are banding together to probe the Target data breach, New York Attorney General Eric Schneiderman said on Friday."}, {"headline": "CGI says contract over HealthCare.Gov to end in February", "lon": "-73.9865812", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0915820140110", "location": "NEW YORK ", "lat": "40.7305991", "short_text": "NEW YORK (Reuters) - CGI Group Inc's contract with the U.S. government over the federal HealthCare.Gov website will end next month, the company said on Friday."}]
