data=[{"headline": "Analysis: Apps for mobile viewing challenge cable operators, TV networks", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0506H20140106", "location": "", "lat": "None", "short_text": "(Reuters) - U.S. cable and satellite television operators, already locking horns with programmers over subscriber fees, are now squaring off over the mobile apps that viewers are increasingly using to watch TV."}, {"headline": "Nvidia CEO talks up mobile chips with brawny PC graphics", "lon": "-115.1611806", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0505O20140106", "location": "LAS VEGAS ", "lat": "36.145204", "short_text": "LAS VEGAS (Reuters) - Chipmaker Nvidia Corp gave new details of an upcoming chip with beefed-up graphics for mobile gadgets and cars as it faces a slowing personal computer industry and harsh competition in smartphones and tablets."}, {"headline": "App developers see wearable devices as next big thing", "lon": "-122.419199", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0501120140106", "location": "SAN FRANCISCO ", "lat": "37.7789601", "short_text": "SAN FRANCISCO (Reuters) - Wearable computers like Google Glass and the Samsung Galaxy Gear watch may not have caught fire yet, but that hasn't stopped mobile game developers from rushing to create apps for the new devices, eager to seize what they hope is the next big moment in consumer technology."}, {"headline": "Yahoo says some ads on its European sites spread malware", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA040IE20140105", "location": "", "lat": "None", "short_text": "(Reuters) - Some advertisements on Yahoo Inc's European websites last week spread malicious software, Yahoo said on Sunday, potentially infecting thousands of users."}, {"headline": "HTC fourth-quarter profit below expectations", "lon": "121.5637", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0403F20140105", "location": "TAIPEI ", "lat": "25.0375167", "short_text": "TAIPEI (Reuters) - Taiwanese smartphone maker HTC reported a worse than expected net fourth-quarter profit on Sunday, despite aggressive cost cutting and a one-time gain."}, {"headline": "Lottery companies cash in as China raises bet on punters", "lon": "114.1623665", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA040G920140105", "location": "HONG KONG ", "lat": "22.3858294", "short_text": "HONG KONG (Reuters) - Every day during his lunch break, Chinese businessman Shen Bin buys three lottery tickets for about 33 cents apiece and then watches to see if his chosen numbers flash across television screens suspended from the ceiling."}, {"headline": "BlackBerry sues Ryan Seacrest's company over iPhone keyboard", "lon": "-79.3849008", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA020R420140103", "location": "TORONTO ", "lat": "43.6529206", "short_text": "TORONTO (Reuters) - BlackBerry Ltd said on Friday it had filed a lawsuit against a company co-founded by \"American Idol\" host Ryan Seacrest that offers a physical keyboard that can be attached to some of Apple Inc's touchscreen iPhone 5 models."}, {"headline": "AT&T; pushes to lure T-Mobile customers; may herald price war", "lon": "-73.9865812", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA020HQ20140103", "location": "NEW YORK ", "lat": "40.7305991", "short_text": "NEW YORK (Reuters) - AT&T; Inc on Friday offered customers of No.4 U.S. mobile provider T-Mobile U.S. Inc a $200 credit to switch to its service, firing the first volley this year in what may become a price war that benefits consumers but plays havoc with profits across the industry."}, {"headline": "FireEye market value surges by a third after Mandiant deal", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA010W220140103", "location": "", "lat": "None", "short_text": "(Reuters) - Shares of cybersecurity provider FireEye Inc rose as much as 35 percent on Friday after the company bought computer forensics specialist Mandiant Corp for $1 billion in a deal that underscores increasing consolidation in the red-hot sector."}, {"headline": "Abu Dhabi's ATIC to invest up to $10 billion in U.S. chip plant", "lon": "54.3705762", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA020EG20140103", "location": "ABU DHABI ", "lat": "24.4747961", "short_text": "ABU DHABI (Reuters) - Abu Dhabi's Advanced Technology Investment Co (ATIC) plans to invest up to $10 billion over the next two years in GlobalFoundries' upstate New York semiconductor factory, its chief executive said on Friday."}, {"headline": "NSA developing computer to crack privacy codes: report", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0201R20140103", "location": "", "lat": "None", "short_text": "(Reuters) - The U.S. National Security Agency is trying to develop a computer that could ultimately break most encryption programs, whether they are used to protect other nations' spying programs or consumers' bank accounts, The Washington Post reported on Thursday."}, {"headline": "ATIC to invest up to $10 billion in GlobalFoundries chip plant", "lon": "54.3705762", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA020CY20140103", "location": "ABU DHABI ", "lat": "24.4747961", "short_text": "ABU DHABI (Reuters) - Abu Dhabi's Advanced Technology Investment Company (ATIC) plans to invest up to $10 billion over the next two years in GlobalFoundries' New York semiconductor factory, its CEO said on Friday."}, {"headline": "Telefonica readying joint offer for TIM Brasil: report", "lon": "9.1906166", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0205Y20140103", "location": "MILAN ", "lat": "45.4666211", "short_text": "MILAN (Reuters) - Telefonica is working on a joint offer to take over TIM Participacoes and break up the local wireless unit of Telecom Italia also known as TIM Brasil, an Italian daily said on Friday citing \"reliable sources.\""}, {"headline": "China No. 3 smartphone maker aims to double sales target in 2014", "lon": "121.4888922", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0206K20140103", "location": "SHANGHAI ", "lat": "31.2253441", "short_text": "SHANGHAI (Reuters) - China Wireless Technologies Ltd, the country's third biggest smartphone maker by sales, plans to double its sales target this year, the latest budget Chinese handset maker eyeing a windfall in the world's largest mobile phone market."}, {"headline": "Snapchat says millions of user accounts compromised", "lon": "-122.419199", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0201C20140103", "location": "SAN FRANCISCO ", "lat": "37.7789601", "short_text": "SAN FRANCISCO (Reuters) - Snapchat, the red-hot private messaging service, said on Thursday that it knew for months about a security loophole that allowed hackers this week to harvest millions of phone numbers and announced changes to its systems."}, {"headline": "Ride service Uber, brash darling of Silicon Valley, stalks new markets", "lon": "-122.419199", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA010SP20140103", "location": "SAN FRANCISCO ", "lat": "37.7789601", "short_text": "SAN FRANCISCO (Reuters) - Uber Chief Executive Travis Kalanick knows the value of a good controversy."}, {"headline": "Skype says user information safe in Syrian Electronic Army hack", "lon": "-118.2427025", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0101X20140102", "location": "LOS ANGELES ", "lat": "34.0536781", "short_text": "LOS ANGELES (Reuters) - A day after the Syrian Electronic Army said it had hacked into Skype's social media accounts, the Internet calling service acknowledged on Thursday it had been hit with a \"cyber attack\" but said no user information was compromised."}, {"headline": "FireEye buys cyber forensics firm Mandiant for about $1 billion", "lon": "-71.0595678", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA010W220140102", "location": "BOSTON ", "lat": "42.3604823", "short_text": "BOSTON (Reuters) - Cybersecurity company FireEye Inc has acquired Mandiant Corp, the computer forensics specialist best known for unveiling a secretive Chinese military unit believed to be behind a series of hacking attacks on U.S. companies."}, {"headline": "BlackBerry and singer Alicia Keys to part ways", "lon": "-79.3849008", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA010WT20140102", "location": "TORONTO ", "lat": "43.6529206", "short_text": "TORONTO (Reuters) - Alicia Keys and BlackBerry Ltd will cut ties at the end of January, just one year after the Grammy-winning singer-songwriter was hired as a \"global creative director\" for the struggling smartphone maker."}, {"headline": "China's Xiaomi says to more than double smartphone sales in 2014", "lon": "116.625088590652", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA010B920140102", "location": "BEIJING ", "lat": "40.2505379", "short_text": "BEIJING (Reuters) - Chinese budget smartphone maker Xiaomi plans to sell 40 million handsets in 2014, more than double the number it sold in 2013, its chairman said on Thursday, reinforcing the company's ambitions to outsell more expensive offerings from Apple Inc and Samsung Electronics Co Ltd."}]
