data=[{"headline": "FireEye buys cyber forensics firm Mandiant for about $1 billion", "lon": "-71.0595678", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA010W220140103", "location": "BOSTON ", "lat": "42.3604823", "short_text": "BOSTON (Reuters) - Cybersecurity company FireEye Inc has acquired Mandiant Corp, the computer forensics specialist best known for unveiling a secretive Chinese military unit believed to be behind a series of hacking attacks on U.S. companies."}, {"headline": "Abu Dhabi's ATIC to invest up to $10 billion in U.S. chip plant", "lon": "54.3705762", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA020EG20140103", "location": "ABU DHABI ", "lat": "24.4747961", "short_text": "ABU DHABI (Reuters) - Abu Dhabi's Advanced Technology Investment Company (ATIC) plans to invest up to $10 billion over the next two years in GlobalFoundries' New York semiconductor factory, its chief executive said on Friday."}, {"headline": "ATIC to invest up to $10 billion in GlobalFoundries chip plant", "lon": "54.3705762", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA020CY20140103", "location": "ABU DHABI ", "lat": "24.4747961", "short_text": "ABU DHABI (Reuters) - Abu Dhabi's Advanced Technology Investment Company (ATIC) plans to invest up to $10 billion over the next two years in GlobalFoundries' New York semiconductor factory, its CEO said on Friday."}, {"headline": "NSA developing computer to crack privacy codes: report", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0201R20140103", "location": "", "lat": "None", "short_text": "(Reuters) - The U.S. National Security Agency is trying to develop a computer that could ultimately break most encryption programs, whether they are used to protect other nations' spying programs or consumers' bank accounts, The Washington Post reported on Thursday."}, {"headline": "Telefonica readying joint offer for TIM Brasil: report", "lon": "9.1906166", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0205Y20140103", "location": "MILAN ", "lat": "45.4666211", "short_text": "MILAN (Reuters) - Telefonica is working on a joint offer to take over TIM Participacoes and break up the local wireless unit of Telecom Italia also known as TIM Brasil, an Italian daily said on Friday citing \"reliable sources.\""}, {"headline": "China No. 3 smartphone maker aims to double sales target in 2014", "lon": "121.4888922", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0206K20140103", "location": "SHANGHAI ", "lat": "31.2253441", "short_text": "SHANGHAI (Reuters) - China Wireless Technologies Ltd, the country's third biggest smartphone maker by sales, plans to double its sales target this year, the latest budget Chinese handset maker eyeing a windfall in the world's largest mobile phone market."}, {"headline": "Ride service Uber, brash darling of Silicon Valley, stalks new markets", "lon": "-122.419199", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA010SP20140103", "location": "SAN FRANCISCO ", "lat": "37.7789601", "short_text": "SAN FRANCISCO (Reuters) - Uber Chief Executive Travis Kalanick knows the value of a good controversy."}, {"headline": "Snapchat says millions of user accounts compromised", "lon": "-122.419199", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0201C20140103", "location": "SAN FRANCISCO ", "lat": "37.7789601", "short_text": "SAN FRANCISCO (Reuters) - Snapchat, the red-hot private messaging service, said on Thursday that it knew for months about a security loophole that allowed hackers this week to harvest millions of phone numbers and announced changes to its systems."}, {"headline": "China's Xiaomi says to more than double smartphone sales in 2014", "lon": "116.625088590652", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA010B920140102", "location": "BEIJING ", "lat": "40.2505379", "short_text": "BEIJING (Reuters) - Chinese budget smartphone maker Xiaomi plans to sell 40 million handsets in 2014, more than double the number it sold in 2013, its chairman said on Thursday, reinforcing the company's ambitions to outsell more expensive offerings from Apple Inc and Samsung Electronics Co Ltd."}, {"headline": "Skype says user information safe in Syrian Electronic Army hack", "lon": "-118.2427025", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0101X20140102", "location": "LOS ANGELES ", "lat": "34.0536781", "short_text": "LOS ANGELES (Reuters) - A day after the Syrian Electronic Army said it had hacked into Skype's social media accounts, the Internet calling service acknowledged on Thursday it had been hit with a \"cyber attack\" but said no user information was compromised."}, {"headline": "BlackBerry and singer Alicia Keys to part ways", "lon": "-79.3849008", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA010WT20140102", "location": "TORONTO ", "lat": "43.6529206", "short_text": "TORONTO (Reuters) - Alicia Keys and BlackBerry Ltd will cut ties at the end of January, just one year after the Grammy-winning singer-songwriter was hired as a \"global creative director\" for the struggling smartphone maker."}, {"headline": "Perion eyes $1 billion in revenue, more acquisitions in next five years", "lon": "35.2247239", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA010PF20140102", "location": "JERUSALEM ", "lat": "31.7774287", "short_text": "JERUSALEM (Reuters) - Perion Network Ltd said it was targeting annual revenue of $1 billion in the next five years following the acquisition of Conduit Ltd's ClientConnect business."}, {"headline": "Hackers post account info of 4.6 million Snapchat users: report", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0102820140102", "location": "", "lat": "None", "short_text": "(Reuters) - Computer hackers posted online usernames and partial phone numbers of 4.6 million users of mobile photo-sharing service Snapchat, media reports said on Wednesday."}, {"headline": "AllThingsD editors launch \"Re/code\" venture with NBCUniversal backing", "lon": "-122.419199", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0105E20140102", "location": "SAN FRANCISCO ", "lat": "37.7789601", "short_text": "SAN FRANCISCO (Reuters) - Veteran technology journalists Walt Mossberg and Kara Swisher have unveiled \"Re/code,\" a technology news site and conference business to succeed AllThingsD which they founded and built into a premier tech media brand within News Corp."}, {"headline": "Samsung Electronics drops 5 percent on weak earnings outlook, soaring won", "lon": "126.9953036", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0101F20140102", "location": "SEOUL ", "lat": "37.5710824", "short_text": "SEOUL (Reuters) - Samsung Electronics Co Ltd fell more than 5 percent on Thursday to its lowest in over four months, weighed down by analysts' forecasts of lower quarterly earnings due to the strong won currency and weaker margins at its display business."}, {"headline": "Apple says never worked with NSA on iPhone hacks", "lon": "-122.419199", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBRE9BU0IP20131231", "location": "SAN FRANCISCO ", "lat": "37.7789601", "short_text": "SAN FRANCISCO (Reuters) - Apple Inc has never worked with the U.S. National Security Agency and is unaware of efforts to target its smartphones, the company said in response to reports that the spy agency had developed a system to hack into and monitor iPhones."}, {"headline": "Snapchat, Vine among top smartphone apps of 2013", "lon": "-79.3849008", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBRE9BU0K820131231", "location": "TORONTO ", "lat": "43.6529206", "short_text": "TORONTO (Reuters) - Snapchat, Vine, and Candy Crush Saga earned coveted spots on smartphones this year, making them among the most downloaded apps of the year."}, {"headline": "Hewlett-Packard to cut 5,000 more jobs", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBRE9BU0EA20131231", "location": "", "lat": "None", "short_text": "(Reuters) - Hewlett-Packard Co said it would cut 5,000 more jobs, bringing the total number of layoffs to 34,000, or 11 percent of its workforce."}, {"headline": "Justice Department defends Apple monitor in e-books case", "lon": "-73.9865812", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBRE9BU0F420131231", "location": "NEW YORK ", "lat": "40.7305991", "short_text": "NEW YORK (Reuters) - A bitter battle between Apple Inc and a lawyer appointed to monitor its compliance with a court antitrust ruling escalated on Monday, as the U.S. government and the monitor both hit back at Apple."}, {"headline": "Deutsche Telekom's new CEO faces twin tests", "lon": "8.66195118582712", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBRE9BU03520131231", "location": "FRANKFURT ", "lat": "50.12134215", "short_text": "FRANKFURT (Reuters) - When Deutsche Telekom's new Chief Executive Tim Hoettges takes office on Wednesday, a revival of mergers and acquisitions in the sector and a dramatically changing competitive landscape in Germany will pose his biggest challenges."}]
