data=[{"headline": "Russia's Yandex to get access to Facebook content", "lon": "37.6187012", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0D0IB20140114", "location": "MOSCOW ", "lat": "55.7516147", "short_text": "MOSCOW (Reuters) - Russian internet group Yandex has signed an agreement with Facebook for access to content from some of the social networking site's users in a move to further improve its search results."}, {"headline": "U.S. appeals court strikes down FCC net neutrality rules", "lon": "-120.2126139", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0D11420140114", "location": "WASHINGTON ", "lat": "47.2868352", "short_text": "WASHINGTON (Reuters) - A U.S. appeals court on Tuesday rejected federal rules that required Internet providers to treat all web traffic equally, a decision that could allow mobile carriers and other broadband providers to charge content providers for faster access to websites and products."}, {"headline": "Google gains entry to home and prized team with $3.2 billion Nest deal", "lon": "-122.419199", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0C1HP20140114", "location": "SAN FRANCISCO ", "lat": "37.7789601", "short_text": "SAN FRANCISCO (Reuters) - Google Inc took its biggest step to go deeper into consumers' homes, announcing a $3.2 billion deal to buy smart thermostat and smoke alarm-maker Nest Labs Inc, scooping up a promising line of products and a prized design team led by the \"godfather\" of the iPod."}, {"headline": "Tesla demand surges, stock rises 16 percent", "lon": "-83.0567375", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0D14H20140114", "location": "DETROIT ", "lat": "42.3486635", "short_text": "DETROIT (Reuters) - Electric car maker Tesla Motors Inc said on Tuesday deliveries of its Model S sedan in the fourth quarter blew past what the company had forecast, sending shares up nearly 16 percent."}, {"headline": "GameStop's profit forecast misses St as older game sales lag", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0D0UQ20140114", "location": "", "lat": "None", "short_text": "(Reuters) - GameStop Corp, the world's largest videogame retailer, warned of lower-than-expected profit as sales sagged for games played on older versions of Xbox and PlayStation consoles."}, {"headline": "Apple loses court bid to block e-book antitrust monitor", "lon": "-73.9865812", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0C1HY20140114", "location": "NEW YORK ", "lat": "40.7305991", "short_text": "NEW YORK (Reuters) - Apple Inc lost a bid on Monday to block an antitrust monitor appointed after a judge found that the company had conspired to fix e-book prices."}, {"headline": "With data vulnerable, retailers look for tougher security", "lon": "-78.7375289", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0C09O20140113", "location": "BOSTON/NEW YORK ", "lat": "42.6289495", "short_text": "BOSTON/NEW YORK (Reuters) - A top retail trade group executive on Sunday called for tougher security standards that could mean more spending for the industry, its banks and business partners after a series of data breaches at major merchants."}, {"headline": "Want to quit your job? New app does it for you via text message", "lon": "-79.3849008", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0C0II20140113", "location": "TORONTO ", "lat": "43.6529206", "short_text": "TORONTO (Reuters) - Thinking about quitting your job? A humorous new app aims to relieve the stress and anxiety of confronting the boss with the news by sending a text message instead."}, {"headline": "U.S. Supreme Court refuses to hear Internet shopping patent case", "lon": "-120.2126139", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0C13Q20140113", "location": "WASHINGTON ", "lat": "47.2868352", "short_text": "WASHINGTON (Reuters) - The U.S. Supreme Court said on Monday it would not take on an Internet technology patent case that pitted a company accused of aggressively enforcing weak patents against another with an equally tough reputation for fighting patent infringement claims."}, {"headline": "Demand Media moves to separate its domain business", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0C0UT20140113", "location": "", "lat": "None", "short_text": "(Reuters) - Demand Media moved on Monday to spin off its Rightside Group domain business as a separately traded company, according to filing with the U.S. Securities and Exchange Commission."}, {"headline": "Factbox: Google's forays beyond the search box", "lon": "-122.419199", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0D00620140114", "location": "SAN FRANCISCO ", "lat": "37.7789601", "short_text": "SAN FRANCISCO (Reuters) - Google Inc announced plans to acquire smart thermostat maker Nest Labs Inc for $3.2 billion, signaling the Internet company's intention to expand into a broader array of devices and bringing valuable hardware design expertise in-house."}, {"headline": "Google to acquire Nest for $3.2 billion in cash", "lon": "-122.419199", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0C1HP20140113", "location": "SAN FRANCISCO ", "lat": "37.7789601", "short_text": "SAN FRANCISCO (Reuters) - Google Inc took its biggest step to go deeper into consumers' homes, announcing a $3.2 billion deal to buy smart thermostat and smoke alarm-maker Nest Labs Inc, scooping up a promising line of products and a prized design team led by the \"godfather\" of the iPod."}, {"headline": "Apple loses bid to block antitrust monitorship", "lon": "-73.9865812", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0C1HY20140113", "location": "NEW YORK ", "lat": "40.7305991", "short_text": "NEW YORK (Reuters) - Apple Inc lost a bid on Monday to block an antitrust monitor appointed after a judge's finding that the company conspired to fix e-book prices."}, {"headline": "Target apologizes for data breach, retailers embrace security upgrade", "lon": "-78.7375289", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0B01720140113", "location": "BOSTON/NEW YORK ", "lat": "42.6289495", "short_text": "BOSTON/NEW YORK (Reuters) - Target Corp began a major public relations effort on Monday to apologize to customers for an unprecedented cyber attack on its network, but the No. 3 U.S. retailer was vague in providing details about what it knew and when."}, {"headline": "Target planning 'significant changes' after data breach - CNBC", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA090L120140113", "location": "", "lat": "None", "short_text": "(Reuters) - Target Corp plans to make \"significant changes\" in light of the data breach during the holiday shopping season when hackers stole personal information of millions of customers, the U.S. retailer's chief executive said in an interview with CNBC aired on Monday."}, {"headline": "New Acer CEO disappoints with lack of detail on future plans", "lon": "121.5637", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0C0HF20140113", "location": "TAIPEI ", "lat": "25.0375167", "short_text": "TAIPEI (Reuters) - Investors looking for specifics as to the future of Acer Inc, the world's No.4 PC vendor, came away disappointed when the new CEO spent more time delivering a history of the company's past mistakes than on where it was headed."}, {"headline": "Australia's Telstra to offload majority stake in struggling Sensis", "lon": "151.2164539", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0A05L20140113", "location": "SYDNEY ", "lat": "-33.8548157", "short_text": "SYDNEY (Reuters) - Australia's biggest phone company Telstra Corporation Ltd has agreed to sell 70 percent of its directories unit Sensis, offloading a struggling business challenged by digital transition for less than the market had anticipated."}, {"headline": "Exclusive: More well-known U.S. retailers victims of cyber attacks - sources", "lon": "-81.1984426", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0B01720140112", "location": "BOSTON/WASHINGTON ", "lat": "39.8881269", "short_text": "BOSTON/WASHINGTON (Reuters) - Target Corp and Neiman Marcus are not the only U.S. retailers whose networks were breached over the holiday shopping season last year, according to sources familiar with attacks on other merchants that have yet to be publicly disclosed."}, {"headline": "Changing card PIN only first step after Target breach: experts", "lon": "-73.9865812", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0B0L820140112", "location": "NEW YORK ", "lat": "40.7305991", "short_text": "NEW YORK (Reuters) - Changing the security code for your debit card may be as easy 1-2-3 following a widespread data breach at Target but guarding your personal information from hackers is a longer-term battle, according to experts."}, {"headline": "Accenture named lead contractor for Obamacare website: government", "lon": "-120.2126139", "weblink": "http://us.mobile.reuters.com/shortArticle/technologyNews/idUSBREA0A0J820140111", "location": "WASHINGTON ", "lat": "47.2868352", "short_text": "WASHINGTON (Reuters) - Accenture has been chosen to replace CGI Federal as the lead contractor for the Obamacare enrollment website, which failed to work when it launched in October for millions of Americans shopping for health insurance, the U.S. Centers for Medicare and Medicaid Services said on Saturday."}]
