data=[{"headline": "World powers and Iran to resume nuclear talks in February", "lon": "4.36748762309029", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0C0L920140113", "location": "BRUSSELS ", "lat": "50.84340935", "short_text": "BRUSSELS (Reuters) - World powers and Iran will very likely resume negotiations on the Islamic Republic's nuclear ambitions in February, shortly after an interim, six-month deal restricting its atomic work goes into effect, a diplomatic source told Reuters on Monday."}, {"headline": "No resistance as crowds occupy Thai capital in festive protest", "lon": "100.416084040605", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0B03C20140113", "location": "BANGKOK ", "lat": "13.5859271", "short_text": "BANGKOK (Reuters) - Tens of thousands of anti-government protesters occupied parts of central Bangkok on Monday, ratcheting up a two-month agitation to force the resignation of Thai Prime Minister Yingluck Shinawatra and meeting no resistance."}, {"headline": "Sharon funeral highlights conflicting views", "lon": "35.2247239", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0C0DZ20140113", "location": "JERUSALEM ", "lat": "31.7774287", "short_text": "JERUSALEM (Reuters) - Israel paid homage to former Prime Minister Ariel Sharon at the first of two funeral services being held on Monday for a man celebrated as a war hero at home but seen by many in the Arab world as a war criminal."}, {"headline": "Kerry, Lavrov say broach ceasefire zone for Syria", "lon": "2.3521334", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0C0KK20140113", "location": "PARIS ", "lat": "48.8565056", "short_text": "PARIS (Reuters) - U.S. Secretary of State John Kerry and Russian counterpart Sergei Lavrov discussed the possibility of ceasefires in parts of Syria, Kerry said on Monday after talks in Paris."}, {"headline": "Hungary PM to meet Russia's Putin, nuclear deal likely", "lon": "19.0404707", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0C0PM20140113", "location": "BUDAPEST ", "lat": "47.4983815", "short_text": "BUDAPEST (Reuters) - Hungarian Prime Minister Viktor Orban and Russian President Vladimir Putin will meet in Moscow on Tuesday, the Kremlin said on Monday, and a diplomatic source said they were likely to sign a nuclear cooperation deal."}, {"headline": "Insight: Gold mine stirs hope and anger in shattered Greece", "lon": "23.9811134", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0C0DG20140113", "location": "OURANOUPOLI, Greece ", "lat": "40.3261645", "short_text": "OURANOUPOLI, Greece (Reuters) - A Canadian quest to mine for gold in the lush forests of northern Greece is testing the government's resolve to prove Europe's most ravaged economy is open again for business."}, {"headline": "North Yemen strife has killed at least 210, Salafis say", "lon": "44.2005197", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0C0IN20140113", "location": "SANAA ", "lat": "15.342101", "short_text": "SANAA (Reuters) - At least 210 people have been killed in two months of fighting between Shi'ite Muslim Houthis and ultra-conservative Sunni Salafis in northern Yemen, a Salafi spokesman said on Monday."}, {"headline": "Early morning bomb damages Budapest bank branch, no one hurt", "lon": "19.0404707", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0C0EB20140113", "location": "BUDAPEST ", "lat": "47.4983815", "short_text": "BUDAPEST (Reuters) - A bomb blew up at the Budapest branch of the Hungarian CIB Bank in the early hours of Monday morning, but police said no one was injured."}, {"headline": "After North Korea, emotional Rodman urges no politics for a day", "lon": "116.625088590652", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0C09520140113", "location": "BEIJING ", "lat": "40.2505379", "short_text": "BEIJING (Reuters) - Retired U.S. basketball star Dennis Rodman appealed on Monday for the world to set aside politics, if only for a day, as he arrived in China from North Korea where he sparked an outcry with comments over an American imprisoned there."}, {"headline": "UK confirms debt pledge ahead of Scottish referendum", "lon": "-0.1276597", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0C01O20140113", "location": "LONDON ", "lat": "51.5072759", "short_text": "LONDON (Reuters) - The British government confirmed on Monday that it will take responsibility for all British government debt should Scotland vote for independence in September, a move it hopes will avoid jitters in bond markets ahead of the referendum."}, {"headline": "Thai government backs-up amid Bangkok shutdown", "lon": "100.416084040605", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0C0QE20140113", "location": "BANGKOK ", "lat": "13.5859271", "short_text": "BANGKOK (Reuters) - The Thai Foreign Ministry once occupied a neoclassical palace built for a revered 19th-century king."}, {"headline": "EU sanctions relief for Iran to go fully into effect on January 20", "lon": "-0.1760968", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0C0Q620140113", "location": "BRUSSELS/LONDON ", "lat": "51.4616797", "short_text": "BRUSSELS/LONDON (Reuters) - European Union governments will implement all EU sanctions relief for Iran covered by a landmark nuclear deal on January 20, the day the agreement takes effect - including lifting a ban on insuring its oil, officials said on Monday."}, {"headline": "India breaks free of polio in boost to global immunization drive", "lon": "77.2159562", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0C0G520140113", "location": "NEW DELHI ", "lat": "28.6138967", "short_text": "NEW DELHI (Reuters) - India on Monday marked three years since its last reported case of polio, paving the way for it to be declared free of the crippling virus and boosting efforts to wipe out the disease globally, the Organization (WHO) said."}, {"headline": "Dubai ruler calls for Iran sanctions to be lifted: BBC", "lon": "55.2961931", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0C08A20140113", "location": "DUBAI ", "lat": "25.2683528", "short_text": "DUBAI (Reuters) - The ruler of Dubai, a Gulf trade and investment hub with strong links to Iran, said in remarks broadcast on Monday that the international community should ease sanctions on the Islamic Republic."}, {"headline": "UAE PM says treatment of jailed American was unfair", "lon": "55.2961931", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0C0FS20140113", "location": "DUBAI ", "lat": "25.2683528", "short_text": "DUBAI (Reuters) - The prime minister of the United Arab Emirates said on Monday that the treatment of a U.S. citizen who spent nine months in jail for posting a parody video on YouTube was unfair, and suggested it was a mistake the UAE would learn from."}, {"headline": "China can avoid Japan-style property bubble: official", "lon": "116.625088590652", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0C0FN20140113", "location": "BEIJING ", "lat": "40.2505379", "short_text": "BEIJING (Reuters) - China's policy fine-tuning and ongoing urbanization can help it to avoid a Japan-style property bubble, a senior housing official said, amid fears a housing market crash could lead to a hard landing for the world's second-largest economy."}, {"headline": "China chides Japan for carping over fishing curbs", "lon": "116.625088590652", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0C0FC20140113", "location": "BEIJING ", "lat": "40.2505379", "short_text": "BEIJING (Reuters) - Beijing reacted sharply on Monday to criticism by Japan of new fishing restrictions imposed by China in the South China Sea, expressing \"resolute dissatisfaction\" with a Japanese official's comments at the weekend, and noting Japan has no direct stake in the issue."}, {"headline": "Cambodian court frees former Russian tycoon", "lon": "104.838559046362", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0C0CN20140113", "location": "PHNOM PENH ", "lat": "11.57944155", "short_text": "PHNOM PENH (Reuters) - A Cambodian court freed Russian real estate tycoon Sergei Polonsky on Monday and he will not be extradited to Russia to face embezzlement charges there, his lawyer said."}, {"headline": "Thai PM calls meeting to discuss election timing", "lon": "100.416084040605", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0C0CE20140113", "location": "BANGKOK ", "lat": "13.5859271", "short_text": "BANGKOK (Reuters) - Thai Prime Minister Yingluck Shinawatra has invited leaders of anti-government protesters and political parties to discuss an Election Commission proposal to push back the date of the snap election she called from February 2, a senior aide said on Monday."}, {"headline": "UAE premier says Egypt's Sisi should stay in army: BBC", "lon": "55.2961931", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0C0C020140113", "location": "DUBAI ", "lat": "25.2683528", "short_text": "DUBAI (Reuters) - The Prime Minister of the UAE, a major financial backer of Egypt after the downfall of Islamist President Mohamed Mursi, said the Egyptian army chief was better off staying in the military instead of running for president."}]
