data=[{"headline": "Thai protesters ignore poll, head for downtown Bangkok", "lon": "100.416084040605", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA1005720140203", "location": "BANGKOK ", "lat": "13.5859271", "short_text": "BANGKOK (Reuters) - Thai anti-government protesters who have been camped out in north Bangkok packed their tents and were marching downtown on Monday as they consolidated efforts to topple Prime Minister Yingluck Shinawatra, a day after a disrupted general election."}, {"headline": "Gunmen kidnap second Westerner in Yemen within days: witnesses, police", "lon": "44.2005197", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA1209U20140203", "location": "SANAA ", "lat": "15.342101", "short_text": "SANAA (Reuters) - Unidentified gunmen kidnapped a Western man in Yemen on Monday, witnesses and a police source said, the second abduction in recent days that highlights the increasing breakdown in security in the U.S.-allied country."}, {"headline": "Leftist Costa Rica outsider leads election, run-off expected", "lon": "-84.301611", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA110IV20140203", "location": "SAN JOSE ", "lat": "9.7888222", "short_text": "SAN JOSE (Reuters) - A left-leaning former diplomat edged ahead in Costa Rica's presidential election on Sunday as a strong showing by two leftist parties threatened to wrest power from the centrist government in an April run-off."}, {"headline": "Light aircraft crash kills three at South African airport: official", "lon": "28.0497222", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA1206720140203", "location": "JOHANNESBURG ", "lat": "-26.205", "short_text": "JOHANNESBURG (Reuters) - Three people were killed after a twin propeller airplane crashed trying to land at South Africa's Lanseria airport on Monday morning, the airport chief executive said."}, {"headline": "China says no cover-ups using state secrecy as excuse", "lon": "116.625088590652", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA120AH20140203", "location": "BEIJING ", "lat": "40.2505379", "short_text": "BEIJING (Reuters) - China has unveiled new rules telling officials not to cover up what should be publicly available information using the excuse it is a state secret, in what state media said was a move towards greater government transparency."}, {"headline": "South Africa's Ramphele changes mind on opposition leadership role", "lon": "18.4172485", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA1208N20140203", "location": "CAPE TOWN ", "lat": "-33.9289049", "short_text": "CAPE TOWN (Reuters) - Anti-apartheid activist Mamphela Ramphele will not run as the Democratic Alliance's presidential candidate in this year's election, South Africa's main opposition party said on Monday, a blow to hopes a prominent leader would spur its challenge to the ruling ANC."}, {"headline": "Al Qaeda says has no link with Syrian militant group ISIL", "lon": "35.47843", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA1207L20140203", "location": "BEIRUT ", "lat": "33.8959203", "short_text": "BEIRUT (Reuters) - Al Qaeda's general command said on Monday it has no links with the Islamic State in Iraq and the Levant (ISIL), in an apparent attempt to assert authority over the Islamist militant groups involved in Syria's civil war."}, {"headline": "El Salvador ex-rebel leads vote, well placed for run-off", "lon": "-89.19301", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA110JX20140203", "location": "SAN SALVADOR ", "lat": "13.6977587", "short_text": "SAN SALVADOR (Reuters) - A former left-wing guerrilla commander had a strong lead in El Salvador's presidential election on Sunday and heads into a run-off vote well positioned to defeat a conservative rival who wants to fight powerful street gangs with the army."}, {"headline": "Three explosions rock Yemeni capital Sanaa", "lon": "44.2005197", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA110N120140203", "location": "SANAA ", "lat": "15.342101", "short_text": "SANAA (Reuters) - Three large explosions were heard in Yemen's capital Sanaa on Sunday, close to the defense ministry, the central bank and the former president's home, locals told Reuters."}, {"headline": "Ukraine frees tortured activist as president returns to work", "lon": "30.5234937", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0U0RF20140202", "location": "KIEV ", "lat": "50.4499875", "short_text": "KIEV (Reuters) - The Ukrainian government bowed to intense Western pressure on Sunday to let an opposition activist fly abroad for treatment after his abduction, torture and then attempted arrest by police outraged critics of President Viktor Yanukovich."}, {"headline": "Cuban boat people land in Cayman, headed for Honduras", "lon": "-81.3790628", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA1201L20140203", "location": "GEORGE TOWN, Cayman Islands ", "lat": "19.2952913", "short_text": "GEORGE TOWN, Cayman Islands (Reuters) - A 30-foot (9 meter) sailboat with about 30 Cuban refugees aboard docked in the Cayman Islands on Sunday and passengers said they were hoping to reach Honduras."}, {"headline": "Pakistan's privatization tsar embarks on quest to revive economy", "lon": "73.0645266", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA110M520140202", "location": "ISLAMABAD ", "lat": "33.6947961", "short_text": "ISLAMABAD (Reuters) - Mohammad Zubair was on a cruise dinner with Pakistani Prime Minister Nawaz Sharif in Thailand when he was offered the hardest job of his life: privatizing a huge chunk of the economy while fighting resistance from the opposition and trade unions."}, {"headline": "El Salvador ex-rebel faces gang-fighting conservative in vote", "lon": "-89.19301", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA110JX20140202", "location": "SAN SALVADOR ", "lat": "13.6977587", "short_text": "SAN SALVADOR (Reuters) - A former left-wing guerrilla commander faced-off against a conservative rival who wants to send the army in to fight powerful street gangs in El Salvador's presidential election on Sunday."}, {"headline": "Iran says nuclear talks failure would be 'disaster'", "lon": "11.5754815", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA110CG20140202", "location": "MUNICH ", "lat": "48.1372719", "short_text": "MUNICH (Reuters) - Iran's foreign minister held rare private talks with his U.S. counterpart on Sunday and said it would be a \"disaster\" if Tehran did not turn a provisional agreement to defuse a decade-old dispute over its nuclear program into a permanent deal."}, {"headline": "Demonstrators disregard Thai poll, vow march to oust PM", "lon": "100.416084040605", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA1005720140202", "location": "BANGKOK ", "lat": "13.5859271", "short_text": "BANGKOK (Reuters) - Thai anti-government protesters planned to forge ahead on Monday with efforts to topple Prime Minister Yingluck Shinawatra, a day after a disrupted election that is unlikely to settle the country's long-running political conflict."}, {"headline": "EU, U.S. working on Ukraine aid plan: Ashton", "lon": "4.36748762309029", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA110MH20140202", "location": "BRUSSELS ", "lat": "50.84340935", "short_text": "BRUSSELS (Reuters) - The European Union and the United States are working on a plan for significant short-term financial assistance for Ukraine, EU foreign policy chief Catherine Ashton was quoted on Sunday as saying."}, {"headline": "Injured activist leaves Kiev for treatment in Lithuania", "lon": "30.5234937", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA110FS20140202", "location": "KIEV ", "lat": "50.4499875", "short_text": "KIEV (Reuters) - Dmytro Bulatov, a Ukrainian activist whose torture at the hands of kidnappers outraged anti-government protesters, flew out for treatment in Lithuania on Sunday after officials in Kiev dropped charges against him, allies and diplomats said."}, {"headline": "Sri Lanka rejects 'reckless' U.S. criticism of its rights record", "lon": "79.8532704", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA110KX20140202", "location": "COLOMBO ", "lat": "6.934287", "short_text": "COLOMBO (Reuters) - Sri Lanka rejected U.S. criticism of its human rights record as \"grossly disproportionate\" on Sunday, a day after a senior U.S. official said Washington would table a U.N. resolution against Colombo."}, {"headline": "France sees Iran opportunity if sanctions are lifted: Moscovici", "lon": "2.3521334", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA110KR20140202", "location": "PARIS ", "lat": "48.8565056", "short_text": "PARIS (Reuters) - France will have \"significant commercial opportunities\" in Iran if sanctions are lifted, but Tehran first has to prove its good faith in abiding by nuclear undertakings, Finance Minister Pierre Moscovici said on Sunday."}]
