data=[{"headline": "Tunisia starts voting on new constitution", "lon": "8.91972381599097", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA020F020140103", "location": "TUNIS ", "lat": "33.9220712", "short_text": "TUNIS (Reuters) - Three years after the revolution that sparked uprisings across the Arab world, Tunisia's parliament began voting on Friday on a new constitution that will help put its turbulent progress to democracy back on track."}, {"headline": "U.S. embassy to evacuate more staff from South Sudan", "lon": "None", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0206320140103", "location": "JUBA/ADDIS ABABA ", "lat": "None", "short_text": "JUBA/ADDIS ABABA (Reuters) - The United States evacuated more embassy staff on Friday from South Sudan's capital Juba due to worsening security in the country, where clashes between rebels and the army risk turning into full-blown civil war."}, {"headline": "Cambodian forces open fire as factory strikes turn violent", "lon": "104.838559046362", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0203H20140103", "location": "PHNOM PENH ", "lat": "11.57944155", "short_text": "PHNOM PENH (Reuters) - Cambodian military police opened fire with assault rifles on Friday to quell a protest by stone-throwing garment factory workers demanding higher pay in a crackdown a human rights group said killed four people."}, {"headline": "Turkish court orders jailed Kurdish lawmakers be freed", "lon": "40.2276235", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA020F920140103", "location": "DIYARBAKIR, Turkey ", "lat": "37.9115543", "short_text": "DIYARBAKIR, Turkey (Reuters) - A Turkish court ordered the release from jail on Friday of two Kurdish lawmakers being tried for links to militants in a potential boost to a fragile peace process."}, {"headline": "Iraq army, tribes join fight against al Qaeda forces", "lon": "44.3787992", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA020G720140103", "location": "BAGHDAD ", "lat": "33.3024248", "short_text": "BAGHDAD (Reuters) - Sunni Muslim tribesmen backed by Iraqi troops fought al Qaeda-linked militants for control of Iraq's western province of Anbar on Friday in a critical test of strength for the Shi'ite-led government of Prime Minister Nuri al-Maliki."}, {"headline": "Analysis: Economy becomes liability for Turkey's scandal-hit government", "lon": "28.9651646", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA020GT20140103", "location": "ISTANBUL ", "lat": "41.0096334", "short_text": "ISTANBUL (Reuters) - When a senior Turkish businessman publicly criticized the central bank this week for failing to stabilize the tumbling lira currency, he was taking aim at a pillar of support for the government: its reputation for strong economic management."}, {"headline": "India's PM says to step down, backs Gandhi as successor", "lon": "77.2159562", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0204920140103", "location": "NEW DELHI ", "lat": "28.6138967", "short_text": "NEW DELHI (Reuters) - Indian Prime Minister Manmohan Singh ruled out on Friday serving another term after an election due by May and threw his support behind Nehru-Gandhi dynasty scion Rahul Gandhi to lead the country if their party wins the vote."}, {"headline": "Israel tests Arrow missile shield, sees Hezbollah threat", "lon": "35.2247239", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA020E120140103", "location": "JERUSALEM ", "lat": "31.7774287", "short_text": "JERUSALEM (Reuters) - Israel successfully tested its upgraded Arrow missile interceptor for the second time on Friday, pushing forward work on a U.S.-backed defense against ballistic threats it sees from Lebanon's Hezbollah guerrillas as well as from Iran and Syria."}, {"headline": "Two Egyptian protesters killed in clashes with police", "lon": "31.2436663", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA020FR20140103", "location": "CAIRO ", "lat": "30.0488185", "short_text": "CAIRO (Reuters) - Two protesters were killed as supporters of the Muslim Brotherhood clashed with police in Cairo and in cities across Egypt, medical and security sources said, in a show of defiance despite a state crackdown on the Islamist movement."}, {"headline": "Israel's ex-PM Sharon suffering multi-organ failure: hospital", "lon": "35.2247239", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0208420140103", "location": "JERUSALEM ", "lat": "31.7774287", "short_text": "JERUSALEM (Reuters) - Former Israeli Prime Minister Ariel Sharon, comatose since a 2006 stroke, is close to death as his health continues to decline, the head of the hospital treating him said on Friday."}, {"headline": "Ex-finance minister wins disputed Madagascar election", "lon": "47.5255809", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0206N20140103", "location": "ANTANANARIVO ", "lat": "-18.9100122", "short_text": "ANTANANARIVO (Reuters) - Former finance minister Hery Rajaonarimampianina won Madagascar's first presidential election since a coup in 2009 but his closest rival said the vote was rigged, raising concerns the island could remain mired in political turmoil."}, {"headline": "Chinese icebreaker stuck after helping in Antarctic rescue", "lon": "151.2164539", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA000JX20140103", "location": "SYDNEY ", "lat": "-33.8548157", "short_text": "SYDNEY (Reuters) - A Chinese icebreaker that helped rescue 52 passengers from a Russian ship stranded in Antarctic ice found itself stuck in heavy ice on Friday, further complicating the 9-day \"roller-coaster\" rescue operation."}, {"headline": "Bangladesh ruling party poised to cruise as opposition boycotts poll", "lon": "90.4098792", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA020BF20140103", "location": "DHAKA ", "lat": "23.7282161", "short_text": "DHAKA (Reuters) - With a brass band, horse-drawn carriages and political posters flapping overhead, the rally in an old section of the Bangladesh capital had all the trappings of a spirited election."}, {"headline": "London confirms death of Briton in Libya", "lon": "13.1787929", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA020B320140103", "location": "TRIPOLI ", "lat": "32.8955292", "short_text": "TRIPOLI (Reuters) - Britain on Friday confirmed the death of one of its nationals and said it was also aware of the death of a New Zealander in western Libya, but gave no details of the circumstances in which they died."}, {"headline": "Israel tests Arrow missile shield, eyes Syria, Iran", "lon": "35.2247239", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0204U20140103", "location": "JERUSALEM ", "lat": "31.7774287", "short_text": "JERUSALEM (Reuters) - Israel successfully tested its upgraded Arrow ballistic missile interceptor for the second time on Friday, pushing forward work on a U.S.-backed defense against threats seen from Iran, Syria and Lebanon's Hezbollah guerrillas."}, {"headline": "Thai economy at risk as political rivals vow mass rallies", "lon": "100.416084040605", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA020A720140103", "location": "BANGKOK ", "lat": "13.5859271", "short_text": "BANGKOK (Reuters) - Thailand's finance minister expressed concern about a weak currency and damage to the economy on Friday as supporters and opponents of the government prepared for big rallies this month that risk pushing the divided country to the brink of chaos."}, {"headline": "Australia swelters after record hot 2013; farmers slaughter cattle, bushfire warning", "lon": "151.2164539", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0203720140103", "location": "SYDNEY ", "lat": "-33.8548157", "short_text": "SYDNEY (Reuters) - A searing heatwave is baking central and northern Australia, piling more misery on drought-hit cattle farmers who have been slaughtering livestock as Australia sweltered through the hottest year on record in 2013."}, {"headline": "Jailed Kurdish lawmakers seek freedom after Turkish court ruling", "lon": "40.2276235", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0209N20140103", "location": "DIYARBAKIR, Turkey ", "lat": "37.9115543", "short_text": "DIYARBAKIR, Turkey (Reuters) - Turkey's top court has ruled that the lengthy detention of two Kurdish lawmakers while on trial for supporting militants violated their rights, raising the chances they could be freed in what would be a boost to the peace process."}, {"headline": "Italian navy rescues over 1000 migrants from boats in 24 hours", "lon": "12.4830619", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0208X20140103", "location": "ROME ", "lat": "41.8932575", "short_text": "ROME (Reuters) - The Italian navy rescued more than 1,000 migrants in the 24 hours to Friday from boats trying to reach Europe, authorities said, as an immigration crisis that killed hundreds in the last year showed no signs of easing."}, {"headline": "China says child deaths not linked to hepatitis vaccine", "lon": "116.625088590652", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0204S20140103", "location": "BEIJING ", "lat": "40.2505379", "short_text": "BEIJING (Reuters) - Chinese health authorities said they have found no link between a hepatitis B vaccine and the deaths of nine children who had received those shots, state media said on Friday."}]
