data=[{"headline": "Iraqi air force strikes city to try to oust al Qaeda", "lon": "44.3787992", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0504O20140106", "location": "BAGHDAD ", "lat": "33.3024248", "short_text": "BAGHDAD (Reuters) - Iraqi government forces battling an al Qaeda offensive near the Syrian border launched an air strike on Ramadi city on Sunday killing 25 Islamist militants, according to local officials."}, {"headline": "Japan's Abe wants to explain shrine visit to China, Korea", "lon": "139.7685224", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0508C20140106", "location": "TOKYO ", "lat": "35.6800712", "short_text": "TOKYO (Reuters) - Japanese Prime Minister Shinzo Abe said on Monday he wanted to meet Chinese and South Korean leaders to explain why he visited a controversial war shrine, seen by critics as a symbol of Tokyo's wartime aggression."}, {"headline": "Syria rebels push al Qaeda back; U.S. open to Iran role", "lon": "35.0976289", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA040DG20140106", "location": "AMMAN/JERUSALEM ", "lat": "31.5469554", "short_text": "AMMAN/JERUSALEM (Reuters) - Syrian rebel fighters loyal to al Qaeda ceded ground near the Turkish border to rival Islamists on Sunday, activists said, in what seemed to be a tactical withdrawal to end clashes between Syrian- and foreign-led opponents of President Bashar al-Assad."}, {"headline": "Afghanistan says, 88 prisoners to be freed, despite U.S. concern", "lon": "69.1624302", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0506R20140106", "location": "KABUL ", "lat": "34.5197058", "short_text": "KABUL (Reuters) - Afghanistan will release 88 prisoners as planned even though the United States considers them dangerous and wants them to remain in detention, the board reviewing their cases told Reuters."}, {"headline": "Bangladesh ruling party wins poll hit by violence, boycott", "lon": "90.4098792", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0301N20140106", "location": "DHAKA ", "lat": "23.7282161", "short_text": "DHAKA (Reuters) - Bangladesh's ruling Awami League won a violence-plagued parliamentary election whose outcome was never in doubt after a boycott by the main opposition party."}, {"headline": "Turkey's Erdogan says not opposed to military coup plot retrials", "lon": "28.9651646", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0506Y20140106", "location": "ISTANBUL ", "lat": "41.0096334", "short_text": "ISTANBUL (Reuters) - Turkish Prime Minister Tayyip Erdogan said he would not oppose the retrial of hundreds of military officers convicted on coup plot charges, a case that underlined civilian dominance over a once all-powerful army."}, {"headline": "Rodman leaves for North Korea for basketball on leader Kim's birthday", "lon": "116.625088590652", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0505320140106", "location": "BEIJING ", "lat": "40.2505379", "short_text": "BEIJING (Reuters) - Former NBA basketball star Dennis Rodman left Beijing for North Korea on Monday with a team of retired basketball players to mark the birthday of \"nice guy\" North Korean leader Kim Jong Un."}, {"headline": "Spanish officials to start talks with Panama over canal cost row", "lon": "-85.6545729", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0506720140106", "location": "PANAMA CITY ", "lat": "30.1600827", "short_text": "PANAMA CITY (Reuters) - A Spanish government team will meet officials in Panama on Monday to try and end a cost dispute between a Spanish-led consortium expanding the Panama Canal and the waterway's operator that threatens to stall the huge infrastructure project."}, {"headline": "Singapore Airlines A380 in emergency landing in Azerbaijan, no injuries", "lon": "103.8528878", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0505K20140106", "location": "SINGAPORE ", "lat": "1.2909305", "short_text": "SINGAPORE (Reuters) - Singapore Airlines Ltd said on Monday an Airbus A380 flying from London to Singapore made an emergency landing in Azerbaijan due to cabin depressurization, but there were no injuries to the 467 passengers and 27 crew on board."}, {"headline": "Chinese drug cop implicated in major amphetamine raid: paper", "lon": "116.625088590652", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0504E20140106", "location": "BEIJING ", "lat": "40.2505379", "short_text": "BEIJING (Reuters) - A Chinese drug enforcement officer has been linked to government officials arrested after the seizure of nearly three tons of the drug crystal methamphetamine in the southern province of Guangdong last month, local media reported."}, {"headline": "China sentences six Mongol herders in land-grab case", "lon": "116.625088590652", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0503720140106", "location": "BEIJING ", "lat": "40.2505379", "short_text": "BEIJING (Reuters) - Six herders in China who tried to defend grazing land from expropriation by a forestry firm have been sentenced in the resource-rich Inner Mongolia region, a lawyer and family members said on Monday, in a case that has sparked protests."}, {"headline": "Stampede at China religious event kills 14 - state media", "lon": "116.625088590652", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0500J20140106", "location": "BEIJING ", "lat": "40.2505379", "short_text": "BEIJING (Reuters) - A stampede at a religious ceremony in northwestern China as food was being handed out killed 14 people and injured 10, the official Xinhua news agency reported on Monday."}, {"headline": "Italy's former center-left leader Bersani suffers brain haemorrhage", "lon": "12.4830619", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0500620140106", "location": "ROME ", "lat": "41.8932575", "short_text": "ROME (Reuters) - The former leader of Italy's center-left Pier Luigi Bersani was hospitalized for a brain haemorrhage on Sunday, less than a year after he resigned as head of the Democratic Party (PD) following party upheaval and a disappointing election."}, {"headline": "Western-backed Syrian opposition re-elects Jarba as leader", "lon": "28.9651646", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA040GR20140105", "location": "ISTANBUL ", "lat": "41.0096334", "short_text": "ISTANBUL (Reuters) - Ahmad al-Jarba was re-elected as the Western-backed Syrian opposition's leader for a second six-month term on Sunday, coalition members said, defeating former Syrian prime minister Riyad Hijab."}, {"headline": "Thai tensions to rise as power struggle intensifies", "lon": "100.416084040605", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA040H420140105", "location": "BANGKOK ", "lat": "13.5859271", "short_text": "BANGKOK (Reuters) - Thailand is heading for a political showdown as protesters plan to shut down Bangkok next week to sabotage an election while the government's supporters have vowed to stage massive counter-rallies in the country's provinces."}, {"headline": "Thousands of African migrants protest Israel detention policy", "lon": "34.7805274", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0409820140105", "location": "TEL AVIV ", "lat": "32.0804808", "short_text": "TEL AVIV (Reuters) - Thousands of African migrants, many holding banners demanding freedom for compatriots jailed by Israel, protested on Sunday in a Tel Aviv square against a new open-ended detention law which allows migrants to be sent to a desert prison."}, {"headline": "Saudi King backs Israeli-Palestinian push, Kerry says", "lon": "46.7149069", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBRE9BU0KE20140105", "location": "RIYADH ", "lat": "24.6320297", "short_text": "RIYADH (Reuters) - Saudi King Abdullah offered his \"enthusiastic support\" to U.S. efforts to resolve the Israeli-Palestinian conflict, U.S. Secretary of State John Kerry said on Sunday."}, {"headline": "Khodorkovsky leaves Germany for Switzerland to take sons to school", "lon": "6.1466014", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA040G620140105", "location": "GENEVA ", "lat": "46.2017559", "short_text": "GENEVA (Reuters) - Former Russian oil tycoon Mikhail Khodorkovsky arrived in Switzerland on Sunday, having spent two weeks in Germany since his release from a Russian prison, but gave no clue about his future plans."}, {"headline": "Egypt convicts activists in one case, opens probe into another", "lon": "31.2436663", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0407L20140105", "location": "CAIRO ", "lat": "30.0488185", "short_text": "CAIRO (Reuters) - Twelve Egyptian activists were given one-year suspended jail terms on Sunday in a case brought over an attack on the campaign headquarters of defeated presidential candidate Ahmed Shafik during the 2012 election."}, {"headline": "Bombs kill at least 19 people in Iraqi capital", "lon": "44.3787992", "weblink": "http://us.mobile.reuters.com/shortArticle/worldNews/idUSBREA0407U20140105", "location": "BAGHDAD ", "lat": "33.3024248", "short_text": "BAGHDAD (Reuters) - Car and roadside bombs exploded in commercial areas of Baghdad on Sunday killing at least 19 people, police and medical sources said."}]
